{
  "metadata": {
    "scriptId": 4,
    "title": "Murder at the Space Station",
    "version": 1,
    "description": "A murder mystery set aboard a futuristic space station. The station commander is found dead in the zero-gravity environment, and everyone aboard is a suspect.",
    "setting": "International Space Station Alpha",
    "timePeriod": "Future (2150)",
    "difficulty": "Medium",
    "estimatedDuration": 90,
    "minPlayers": 6,
    "maxPlayers": 8,
    "targetAudience": "12+",
    "tags": ["space", "futuristic", "technology", "isolation", "zero-gravity"],
    "author": "Your Name",
    "createdDate": "7/1/2025",
    "lastModified": "7/1/2025",
    "victim": "Commander Sarah Chen",
    "numberOfRounds": 6,
    "backgroundAsset": "../assets/images/backgrounds/shared-background.png",
    "status": "available",
    "isActive": true,
    "introduction": "Welcome to International Space Station Alpha, humanity's most advanced outpost in the cosmos, where cutting-edge science meets the infinite void of space. Tonight, our mission of discovery has taken a most unexpected turn.\n\nCommander Sarah Chen, the brilliant and respected leader of this space station, has been found dead in her private quarters. The circumstances of her demise are as mysterious as the vast expanse beyond our viewports, and the station has been placed under emergency lockdown protocols.\n\nThe airlocks of Space Station Alpha have been sealed. Mission Control is monitoring the situation from Earth, but for now, you, the elite crew of this orbiting laboratory, are trapped within these metallic walls. Each of you carries secrets, motives, and perhaps even the means to have brought about Commander Chen's untimely end.\n\nIt now falls to you to unravel this cosmic mystery. Examine the evidence, scrutinize the alibis, and expose the hidden truths. Tonight, the greatest discovery will not be in the science labs, but right here, among yourselves, as you determine:\n\nWho killed Commander Sarah Chen?"
  },
  "characters": [
    {
      "characterId": "character-1",
      "Character": "Dr. Alex Rodriguez",
      "Short Description": "Chief Scientist",
      "Sex": "M",
      "isMurderer": false,
      "suggestedAge": "Any",
      "costumeNotes": "Lab coat, glasses",
      "accent": "none",
      "suggestedCostume": "scientist uniform",
      "Invite Description": "You are Dr. Alex Rodriguez, the brilliant but socially awkward chief scientist aboard the space station. Your research on zero-gravity experiments is groundbreaking, but you've been having conflicts with the commander over research priorities.",
      "Introduction": "As the chief scientist aboard this station, my work is of paramount importance. The commander's constant interference with my research schedule has been... problematic. My experiments require precise timing, and her insistence on 'safety protocols' has delayed critical data collection.",
      "Motive": "Commander was blocking his research",
      "Means": "Access to experimental equipment",
      "Opportunity": "Was alone in the lab during the incident",
      "Red Herrings": "- Had heated arguments with commander\n- Was seen near the airlock\n- Research was being threatened",
      "Round 1 - Introduction Script": "I am Dr. Alex Rodriguez, chief scientist aboard this station. My work on zero-gravity cellular regeneration is revolutionary, and I cannot allow bureaucratic interference to compromise my research timeline.\n\nThe commander's... unfortunate accident is regrettable, but perhaps now my experiments can proceed without constant interruptions. The scientific community is waiting for my results, and I will not be delayed further.",
      "Secret information": "You discovered that the commander was planning to shut down your research and transfer you back to Earth. You had just received a prestigious award nomination that would be jeopardized if your work was interrupted. You were desperate to complete your experiments before she could act.",
      "Round 2 - Story": "I was conducting my daily experiments in the zero-gravity lab. The cellular regeneration studies require precise environmental controls, and I was monitoring the data when the emergency alarm sounded. I immediately secured my samples and reported to the command center.",
      "Round 3 - Accuses": "Lt. Kim",
      "Round 3 - Accusation": "I observed Lieutenant Kim entering the commander's quarters just before the incident. She seemed agitated and was carrying what appeared to be a maintenance tool. What business did she have with the commander at that hour?",
      "Round 3 - Accused of": "being obsessed with your research to the point of neglecting safety protocols.",
      "Round 3 - Rebuttal": "Safety protocols are essential, but they must not impede scientific progress. My research could save millions of lives. The commander's overly cautious approach was costing valuable time and resources.",
      "Round 4 - Accuses": "Engineer Patel",
      "Round 4 - Accusation": "I noticed Engineer Patel accessing the station's environmental controls shortly before the incident. The oxygen levels in the commander's quarters were altered. Coincidence? I think not.",
      "Round 4 - Accused of": "using experimental equipment without proper authorization.",
      "Round 4 - Rebuttal": "All my equipment use was properly documented and approved. The commander was aware of my research methods. My work is too important to be delayed by paperwork.",
      "Round 5 - Accuses": "Dr. Williams",
      "Round 5 - Accusation": "Dr. Williams was the last person to speak with the commander before her death. I overheard their conversation about 'budget cuts' and 'mission priorities.' Was this about more than just funding?",
      "Round 5 - Accused of": "having a personal vendetta against the commander for blocking your research.",
      "Round 5 - Rebuttal": "I am a scientist, not a criminal. My disagreements with the commander were professional, not personal. I would never harm anyone, regardless of how they might interfere with my work.",
      "Round 6 - Final statement": "My research is my life's work, and I will defend it vigorously. But I am a scientist, dedicated to understanding life, not taking it. The commander's death is a tragedy, but it was not by my hand. I am innocent.",
      "Order of Final Statement": 3,
      "Why it isn't them": "He needed the commander's approval for his research to continue. Her death would actually delay his work further."
    },
    {
      "characterId": "character-2",
      "Character": "Lt. Maya Kim",
      "Short Description": "Security Officer",
      "Sex": "F",
      "isMurderer": true,
      "suggestedAge": "Any",
      "costumeNotes": "Security uniform, serious demeanor",
      "accent": "none",
      "suggestedCostume": "military-style uniform",
      "Invite Description": "You are Lieutenant Maya Kim, the station's security officer. You're responsible for maintaining order and safety aboard the station, but you've been hiding a dark secret about your past.",
      "Introduction": "As the security officer aboard this station, it's my duty to maintain order and protect the crew. The commander's death is a security failure, and I take full responsibility for not preventing it. I will find the person responsible.",
      "Motive": "Commander discovered her criminal past",
      "Means": "Security training and access to weapons",
      "Opportunity": "Was on duty during the incident",
      "Red Herrings": "- Was seen near the scene\n- Has access to security systems\n- Was the last to see the commander alive",
      "Round 1 - Introduction Script": "I am Lieutenant Maya Kim, security officer aboard this station. The commander's death represents a complete failure of my security protocols, and I will not rest until justice is served.\n\nEvery crew member is now a suspect, and I will investigate thoroughly. The commander trusted me with her safety, and I failed her. I will not fail her again by letting her killer escape justice.",
      "Secret information": "You have a criminal past that you've been hiding. The commander discovered your true identity and was planning to report you to Earth authorities. You couldn't let her expose you and ruin your new life. You had to silence her permanently.",
      "Round 2 - Story": "I was conducting my routine security patrol when I discovered the commander's body. I immediately secured the area and initiated emergency protocols. My training kicked in, and I began the investigation process.",
      "Round 3 - Accuses": "Dr. Rodriguez",
      "Round 3 - Accusation": "I observed Dr. Rodriguez acting suspiciously near the commander's quarters. He was carrying experimental equipment and seemed nervous when I approached. His research obsession has made him unstable.",
      "Round 3 - Accused of": "failing in your security duties and allowing the murder to happen.",
      "Round 3 - Rebuttal": "I performed my duties to the best of my ability. The commander's death was not due to any failure on my part. I am conducting a thorough investigation to bring the killer to justice.",
      "Round 4 - Accuses": "Engineer Patel",
      "Round 4 - Accusation": "Engineer Patel has been acting strangely since the incident. I noticed him accessing restricted areas and tampering with station systems. His technical knowledge could have been used to cover up evidence.",
      "Round 4 - Accused of": "having access to the commander's private quarters without authorization.",
      "Round 4 - Rebuttal": "I have full security clearance and access to all areas of the station. My investigation requires me to examine all evidence thoroughly. I am doing my job, nothing more.",
      "Round 5 - Accuses": "Dr. Williams",
      "Round 5 - Accusation": "Dr. Williams was the last person to speak with the commander. Their conversation was heated, and I overheard threats being made. The commander was planning to take action against someone aboard the station.",
      "Round 5 - Accused of": "being the last person to see the commander alive and failing to protect her.",
      "Round 5 - Rebuttal": "I was not the last person to see the commander alive. I discovered her body during my patrol. My investigation will reveal the truth about who was truly responsible.",
      "Round 6 - Final statement": "I am a security officer, sworn to protect and serve. The commander's death is a tragedy that I will never forget. I have conducted a thorough investigation and will ensure that justice is served. I am innocent of any wrongdoing.",
      "Order of Final Statement": 6,
      "Why it isn't them": "She was the killer - she murdered the commander to prevent her criminal past from being exposed."
    }
  ]
} 