{
  "metadata": {
  "scriptId": 9,
  "title": "Deep Murder 9: The Final Frontier",
  "version": 2,
  "description": "Among the interspecies inhabitants of the space station Deep Murder 9, is a murderer! The stern and unpopular Captain Rostova is found frozen solid and ejected from an airlock. A colorful cast of characters, from a sentient gas cloud to a cyborg engineer, must uncover the killer.",
  "setting": "Space Station Deep Murder 9",
  "timePeriod": "Futuristic",
    "difficulty": "Medium",
  "estimatedDuration": 120,
  "minPlayers": 10,
    "maxPlayers": 10,
  "targetAudience": "Murder Mystery Fans, Sci-Fi Enthusiasts",
  "tags": "Sci-Fi, Murder Mystery, Space, Comedy",
  "author": "AI Assistant",
  "createdDate": "2025-07-14T00:00:00Z",
  "lastModified": "2025-07-14T00:00:00Z",
  "victim": "Captain Eva Rostova",
    "numberOfRounds": 6,
  "backgroundAsset": "../assets/images/backgrounds/SpaceStation.png",
  "status": "Complete",
  "isActive": true,
  "introduction": "Welcome to Deep Murder 9, a beacon of bureaucracy and questionable life choices on the edge of Defenistration space. The station's commander, Captain Eva Rostova, a woman who ruled the station with an iron fist in a chainmail glove, has been found dead. In a shocking turn of events that has surprised no one who knew her, she was discovered flash-frozen and ejected from an airlock, turning her into a permanent, orbiting monument to workplace conflict.\n\nThe station's logs show an unscheduled airlock discharge late last night. Defenistration Detect-o-Bots are on their way. Meanwhile, you, the most prominent (and suspicious) individuals aboard are gathered to solve the crime. Was it a calculated act of vengeance, a crime of passion, or just an avante garde performance art piece?\n\nWhich of you killed Captain Rostova?"
  },
  "characters": [
  {
  "Character": "Daba Dooba",
  "Short Description": "Alien performance artist",
  "Character Details": "You are an avant-garde performance artist who expresses your emotions through eccentric and 'high-concept' art installations. You have a complicated relationship with the Captain and use your art to express your feelings about authority. Your fans eat it up.",
  "Sex": "Any",
  "isMurderer": false,
  "suggestedCostume": "Eccentric, colorful, avant-garde clothing. Possibly adorned with strange, abstract sculptures.",
  "suggestedProps": "Unsettling sculptures made of recycled parts, a pot of 'Hyper-Saturated Nutrient Paste #7' (red paint or jam).",
  "Round 1 - Introduction Script": "Greetings. I am Daba Dooba. I do not simply create the Dooba. I midwife the infant of inspiration and slap it on the behind! Dooba makes you uncomfortable because I am inside of you. 'Dooba' is inside of you, and you, and yes, even you!\n\nThis most recent Dooba of 'Captain as Frozen Popsicle' is obviously that of an amature Doobist. It is obviously derivative of my early Dooba of frozen fish sticks, but I suppose we all must start somewhere.\n\nOur late Captain was what we call a critic. She failed to appreciate my Dooba, 'Bureaucratic Bungler - portrait of an idiotic Captain in Weeping Cheese Product.' She called my Dooba a 'wobbly biohazard' and padlocked my studio!",
  "Secret information": "Captain Rostova had just cut the station's 'Public Art' budget entirely, calling my latest masterpiece, 'Symphony of Screaming Metal and Weeping Fluids,' a \"safety hazard that smells weird.\" She padlocked my studio, which is my soul's external membrane!",
  "Round 2 - Story": "Where was I? Foolish boing boings. I was not in a place; I was in a Dooba. After the Captain padlocked my studio, my sanctuary of spoons, I was locked out of my own soul! But Dooba cannot be contained by a simple deadbolt. Dooba finds a Daba.\n\nI spent the night conducting a protest performance in the main ventilation shaft of Deck 7. This moving and ingenious Dooba was titled, 'My Soul is a Clogged Air Filter.' It was a wibble-izing experience for all who witnessed it, which was no one.",
  "Round 3 - Accuses": "Ace Rocket",
  "Round 3 - Accusation": "Ace Rocket! Your Dooba last week! Your glorious, flumptious Dooba!\n\nI was a privileged witness to your magnificent one-person show, 'The Anguished Howl of the Inebriated Pilot.' And it was... truth! It was more than a performance of anger; it was a pure, unfiltered channeling of the primal scrumple!\n\nSo raw! So glorble! You laid your anger at the Captain bare for all to see. It was the most honest Dooba I have seen on this station!\n\nAnd that, my dear, is the problem. Your Dooba was too good. A true Doobist doesn't fake that kind of homicidal energy. I must, therefore, conclude that your breathtaking Dooba of drunken ravings was but a rehearsal, and the Captain's frozen body was your premier.",
  "Round 3 - Accused of": "writing the popular song '50 ways to kill your Captain.'",
  "Round 3 - Rebuttal": "Ah, my dearest zib-zib! You sing my words! My soul is flumptious! It shows you are open to the Dooba, and that is the first, most blurple step.\n\nBut when I sing of 'killing' the 'Captain', I speak of the Doobist's struggle to 'kill' the inner critic that says your masterpiece of weeping cheese is a 'wobbly biohazard.'  \n\n'Throw 'em out the lock' is not about a door to space; it is the door to self-Doob-ization!\n\nYou see? The Dooba is not a weapon; it is a key to unlocking the great, wibbling truth of the cosmos. Keep listening, my dear fan. You are closer to understanding the true Dooba.",
  "Round 4 - Accuses": "Sprock-ette",
  "Round 4 - Accusation": "Sprock-ette, I have been admiring your Dooba from afar. Your... long-form performance piece.\n\nNinety-three formal complaints! Each one a perfect, miniature Dooba of exquisite, logical resistance. A masterpiece of bureaucratic fury! \n\nBut my dear, a sustained Dooba with that kind of glorble isn't easy and takes a great commitment. I must conclude that your ninety-three complaints were not the performance itself, but merely the program notes for the grand finale of Murder! Bravo!",
  "Round 4 - Accused of": "you being currently covered in blood!",
  "Round 4 - Rebuttal": "Blood? You see blood because your mind is a battlefield. This is not blood; it is 'Hyper-Saturated Nutrient Paste #7.' It is the medium for my latest Dooba, 'The Agony of the De-Funded Doobist.' You see death, Commodore. I was creating life. You are an uncultured brute.",
  "Round 5 - Accuses": "Ensign Expendable",
  "Round 5 - Accusation": "My dear, dear Ensign. I have followed your career with such flumptious glee. Your previous Doobas were masterpieces of existential dread. 'Dodging the Deadly Meteor Shower while Cleaning the Captain's Viewport'? Genius!  And 'Contracting Blorpian Measles to test the Experimental Serum'? A triumph of intestinal fortitude! You were a master of facing the abyss with a kind of glorble, terrified elegance!\n\nBut your latest piece... the one in the launch bay... 'I can do it! I'll go to her right away'? Growing a backbone? It ruined the vibe of your entire collection!",
  "Round 5 - Accused of": "you having fans that would do 'anything' for you.",
  "Round 5 - Rebuttal": "My 'Doobinites' are observers of my soul's beautiful agony, not a private army! They appreciate my Dooba from a respectful distance. \n\nTo use their devotion for un-making would be a most glorble betrayal of trust. It is a fundamental misunderstanding of the Dooba-Doobinite relationship!",
  "Round 6 - Final statement": "My dearest zib-zibs, I have a confession. A revelation so flumptious it may shatter your very perception of me. The truth is... I did not like Captain Rostova.\n\nIt is a great surprise, I know. But I did not act on this bitter scrumple! I transformed my glorble into the subtle and mysterious Doobas that expressed my hidden dislike of the Captain. Who could guess the true meaning behind them?!\n\nI already killed the idea of the Captain 50 times in my Dooba. The literal act would have been redundant.",
  "Order of Final Statement": 7,
  "Why it isn't them": "I am an artist. I transform my negative emotions into 'Dooba,' my performance art. Killing the Captain literally would have been redundant and far less creative than expressing my feelings through a masterpiece like 'Symphony of Screaming Metal and Weeping Fluids.'"
  },
  {
  "Character": "Baba Baklava",
  "Short Description": "Owner of the sweet shop",
  "Character Details": "You are the sweet, elderly shop owner who runs a confectionery business on the space station. But where do you get your exotic ingredients from? You'll never tell.",
  "Sex": "Any",
  "isMurderer": true,
  "suggestedCostume": "A matronly, deceptively sweet-looking outfit with an apron. Perhaps a bit too clean.",
  "suggestedProps": "A tray of colorful, odd-looking candies ('Plutonian Pops,' 'Nebula Nougats'), a friendly smile that doesn't quite reach the eyes.",
  "Round 1 - Introduction Script": "Oh, hello, dearies. I'm Baba Baklava, I run the little sweet shop down on the concourse. It's just a dreadful, dreadful business about the Captain. I know she didn't have many admirers, but I suppose it is harder to make friends when you are dispensing discipline instead of delicious delicacies. I do hope they find the monster who did this. Anyone care for a complimentary Nebula Nougat? They're delightfully chewy.",
  "Secret information": "The Captain discovered that my 'sweet shop' is a front for a massive intergalactic smuggling ring of highly addictive, illegal crystalline rock candy from a Gromulak. She was going to expose me and shut down my entire operation, which is far more lucrative than selling bon-bons.",
  "Round 2 - Story": "I was in my shop, of course. I had a big catering job that required several cartloads of Martian Meringue Melts. They're very temperamental. You have to whip them in zero-G for exactly 47 minutes, or they don't get that lovely airy texture. I didn't leave my kitchen all night. It was just me and my mixers.",
  "Round 3 - Accuses": "Rusty Rivet",
  "Round 3 - Accusation": "Oh, Rusty, dearie, I've always been so fascinated by that marvelous arm of yours. So strong! So efficient! I imagine it could snap a steel girder just as easily as it could whip up a batch of my Jupiter Jujubees. My goodness, a limb like that would be a handy mixer to have in the kitchen! It could probably crush ice, or... well, anything else that's frozen solid, I suppose. It's a dreadful thought, but such a powerful tool could make quick work of a person, couldn't it?",
  "Round 3 - Accused of": "creating your treats with 'artisanal vacuum.'",
  "Round 3 - Rebuttal": "Oh, you poor, misty thing. Of course, it's chilly in my shop, dearie. Some of my most delicate confections, like my famous Martian Meringue Melts, require a perfectly controlled, low-temperature, low-pressure environment to achieve their delightful airy texture. It's a very temperamental process! \n\nThe 'artisanal vacuum' is just what that nice marketing boy calls my flash-chiller. It sounds so much more... fancy, don't you think? It is simply the science of advanced baking, dearie, not a murder weapon. To suggest otherwise is a recipe for slander.",
  "Round 4 - Accuses": "Nimbus C. Cumulus",
  "Round 4 - Accusation": "I know you say you don't like the cold, Nimbus, sweety. It's a terrible thought, but we all know you can make it rain, sleet, and snow. You've complained so much about the dry, chafing air the Captain insisted on. You didn't just happen to create a blizzard right in the Captain's quarters, did you?",
  "Round 4 - Accused of": "you and Fixer whispering in a corridor.",
  "Round 4 - Rebuttal": "Whispering? Heavens, no! Mr. Finnigan has an exceptional supply chain problem solver. Goodness knows that some of my flavors and ingredients are hard to come by! We were simply having a quiet consultation between two small business owners. One must be discreet when discussing trade secrets, you know. It was business, not conspiracy.",
  "Round 5 - Accuses": "Sprock-ette",
  "Round 5 - Accusation": "Sprock-ette, you poor, dear android. Word around the soda-fountain was that the Captain was planning a... 'personality upgrade' for you. An emotional implant? I know you don't see the point of those fuzzy, finicky, human things, but they are the 'spice of life' as they say.\n\nI suppose we all fear change, don't we? It's enough to make a person... or a very logical android... do something terribly drastic to prevent it, wouldn't you agree, dearie?",
  "Round 5 - Accused of": "you hand delivering. the Captain's sweets each week",
  "Round 5 - Rebuttal": "Of course I delivered her sweets personally! It's my signature touch! The Captain was such a stern woman; I simply thought a little handcrafted Nebula Nougat might improve her sour disposition. It was an act of kindness, Mr. Finnigan, not a delivery system for… for anything untoward! To suggest my confections were part of a crime is simply… distasteful.\n\nBesides, how would I get the Captain's body all the way over to the airlock. I'm just a frail, little old lady who couldn't possibly lift such a heavy load.",
  "Round 6 - Final statement": "Oh, you poor, confused dearies. It breaks my heart to see you all turning on each other like this, like little gingerbread men tearing off each other's gumdrop buttons. You keep asking yourselves, 'Would a sweet old lady who gives away free candy really do something so... distasteful?'\n\nWell, let me clear that up for you. Yes. Yes, she would. The Captain, bless her sour little heart, was a pest. She stuck her nose where it didn't belong and found out about my... exclusive recipes. The secret ingredient that makes my rock candy so popular and my profit margins so delightful. She threatened to shut down my sweet little enterprise. She was a bitter ingredient that had to be removed from the batch.\n\nSo, I invited her for a chat. She thought she had me cornered. But in my kitchen, I control the temperature. I offered her a taste of a brand new 'Plutonian Pop,' made with my industrial flash-freezer. She was frozen solid before she could even finish her lecture on 'galactic law.' It was terribly efficient. Getting her to the airlock on my catering cart was no harder than frosting a cake. It wasn't personal, dearies. It was just business. Quality control. She was ruining my recipe. Now, if you'll excuse me, all this talk has made me want a bon-bon.",
  "Order of Final Statement": 10,
  "Why it isn't them": ""
  },
  {
  "Character": "Rusty Rivet",
  "Short Description": "Chief Engineer",
  "Character Details": "Half, man, half cybernetic enhancement, you understand machines. You are the station's brilliant but eccentric chief engineer who keeps these ungrateful and ignorant meatbags safe from the horrors of the vacuum of space, separated by mere millimeters of hull. The ship speaks to you like a lover. To what lengths are you willing to go Your cybernetic arm and a deep",
  "Sex": "Male",
  "isMurderer": false,
  "suggestedCostume": "Grease-stained overalls or engineering jumpsuit. One prominent cybernetic arm.",
  "suggestedProps": "A very large wrench (named 'Betsy'), an oil rag, a diagnostic computer tablet.",
  "Round 1 - Introduction Script": "Rusty Rivet. Chief Engineer. I'm 40% organic, 60% cybernetic parts, and 100% covered in grease. \n\nThe graviton impeller is fluctuating again, the secondary scrubbers are offline, and someone used the high-energy plasma conduit to toast a sandwich. And now this. Another meat-bag problem. \n\nThe Captain was... fine. For an organic who didn't understand the thermal limits of a warp core.",
  "Secret information": "The Captain reversed my order to shut down the entire station for a full system diagnostic. She said we couldn't afford the downtime. I told her the life support system was making a 'funny gurgling sound,' and if it failed, we'd all be breathing vacuum. She called me paranoid.",
  "Round 2 - Story": "I was where I always am, in the guts of the station. The main coolant pump for Deck 7 was running hot. I had to bypass the primary regulator and jury-rig a feedback loop using ol' Betsy and some spare tubing. \n\nIt was a delicate, five-hour job. If I'd left for even a second, the whole deck would have melted into slag, not that the Captain woulda noticed. \n\nNo witnesses. Just me and the hum of a machine that appreciates me.",
  "Round 3 - Accuses": "Sue M. Awl",
  "Round 3 - Accusation": "I've seen the laser feeds on Deep Murder 8. A full system collapse... cascading shutdowns across all primary functions. But not from engineering failure. From you, Sue! \n\nYou didn't just sue them; you disassembled a perfectly good station, and had it auctioned off, bolt by bolt. You're a legal parasite and a station wrecker. And now you've attached yourself to my station. \n\nThe Captain and I didn't always see eye to eye, but I imagine she wouldn't a taken too kindly to a hostile takeover!",
  "Round 3 - Accused of": "having a strong cybernetic arm.",
  "Round 3 - Rebuttal": "Yes. It's a Series 7 industrial cybernetic limb. Torque rating is 8,000 newton-meters. It's calibrated for heavy lifting and micro-millimeter-precise welding. I have a right to bionic arms. To suggest its spine-snapping capacity makes me a murderer is blaming the tool. As they say, 'Series 7 industrial cybernetic limbs don't kill people; People kill people.' \n\nIt's like saying a hydro-spanner is a weapon. You're misinterpreting its primary function. And it is not a mixer. Its lubrication is not food-grade.",
  "Round 4 - Accuses": "Commodore Maximus Pummel",
  "Round 4 - Accusation": "Your service record. States you lost your arm on a mission with the Captain. An organic's command error, no doubt. Left a festering resentment. You got a medal, sure, but the Captain got to brush her teeth with her dominant hand. That's a debt of flesh and bone. Maybe you just decided it was finally time to balance the ledger. A cold calculation for a cold warrior.",
  "Round 4 - Accused of": "you always carrying a really big heavy wrench.",
  "Round 4 - Rebuttal": "This? This is 'Betsy.' She is a precision instrument, calibrated for applying kinetic force to stubborn machinery. Using her for something as crude as murder would be... criminal! It would throw off her torque calibration. \n\nI'm an engineer. I use the right tool for the job. And the right tool for murder is not a Series 4 Hydro-spanner, it'd be a 13.2 gigawatt micro-pulse graviton generator. Not that I've thought about it or anything.",
  "Round 5 - Accuses": "Nimbus C. Cumulus",
  "Round 5 - Accusation": "Nimbus, I admit it. I just don't get you gas-bags. You don't have no moving parts, no wires, or anything solid to bang your hydro-spanner on. I don't trust something I can't grease.\n\nBut I don't need a system diagnostic to know that all week, you were 'stormy.' Moping around, high-pressure, shortin' out all my subsystems with your static charge.\n\nNow that she's gone, you're... 'fluffy.' I don't need to understand your mechanics to understand that you got what you wanted. You look like you just got a system flush and a fresh coat of paint.",
  "Round 5 - Accused of": "you talking to someone intimately.",
  "Round 5 - Rebuttal": "You were skulking in the service conduits? Typical. \n\nI was talking to... my station. She was under unacceptable stress. The Captain had just ordered me to bypass three safety protocols on the warp core's containment field for a pointless time trial. \n\nI was informing the core that the stress would be over soon, and that I was installing a redundant power governor to prevent such a dangerous and frankly, stupid, order from being carried out again. \n\nIt was a private conversation between an engineer and his engine. You wouldn't understand.",
  "Round 6 - Final statement": "The ship is groaning. She needs me. This whole mess is taking time I could be spending reinforcing the primary hull with that hexagonal nanotube mesh that she'd look soooo good in. \n\nPeople break. They're faulty by design. They leak, they make noise, they get emotional. Machines are pure. Their needs are logical. \n\nI was with my true love: the engine core. I didn't do it because I was too busy doing what actually matters: keeping this station, and all of you, alive.",
  "Order of Final Statement": 5,
  "Why it isn't them": "I was in the 'guts of the station' all night, performing a delicate, five-hour repair on a coolant pump. If I had left, the whole deck would have melted. My only loyalty is to the station itself, and I was busy keeping her alive, not helping one of her crew members die."
  },
  {
  "Character": "Ensign Expendable",
  "Short Description": "Red Shirt",
  "Character Details": "You are a junior officer who is in way over his head. Despite your inexperience, and no one knowing your first name, often tasked with the most dangerous missions. You are terrified that the next mission will be your last.",
  "Sex": "Any",
  "isMurderer": false,
  "suggestedCostume": "A bright red Starfleet-style uniform. Looks perpetually terrified.",
  "suggestedProps": "A PADD with a pre-recorded eulogy on it, a will, maybe a lucky charm.",
  "Round 1 - Introduction Script": "Ensign Expendable! Reporting for... oh no, what is this?! An investigation? You mean we're locked in a room and one of us is a murderer? Maybe a shapeshifting mimic is AMONG US? Oh, no, no, no, no... we're all going to get picked off one by one and guess who'll be first!\n\nI knew I shouldn't have worn my new uniform today! It's so... red. So very, very red. At least I've updated my will and prerecorded my own eulogy, just in case. It's very moving.",
  "Secret information": "I just returned from a solo mission the Captain sent me on: to chart the interior of a black hole... with a notepad and a pen. It was my fifth near-suicide mission this month. I'm pretty sure she was actively trying to kill me in a way that looked like an accident.",
  "Round 2 - Story": "I was hiding! After my debriefing, I was convinced the Captain was going to send me to wrestle a Gorn, so I found an empty supply locker in Corridor B, locked myself in, and spent the night listening to my pre-recorded eulogy on a loop. \n\nIt's surprisingly comforting. I really capture the tragedy and grief of a life ended too soon, all while ending on a poignant lesson!",
  "Round 3 - Accuses": "Daba Dooba",
  "Round 3 - Accusation": "Daba Dooba, I'm a big fan! However, I can't help but point out that your most recent hit song is titled 'Fifty Ways to Kill Your Captain.'\n\nIt's catchy, has anyone else heard it?\n\nOoh, throw 'em out the lock, Spock \nVent all the air, Claire \nYou don't need to be coy, Roy\nJust listen to me\n\nGive her a vir-us, Gus\nYou don't need to discuss muuuuuuch\nJust cut the AC, Lee\nAnd get yourself free",
  "Round 3 - Accused of": "always getting the 'best' missions.",
  "Round 3 - Rebuttal": "'Best missions'?! Sir! My last 'mission' was to manually polish the main viewport... from the outside... during a meteor shower! The one before that was to test an experimental serum that had a 72% chance of liquifying my lungs! \n\nThey're not signs of favoritism, they're creatively cruel suicide assignments! I'm not her favorite; I'm her most disposable guinea pig!",
  "Round 4 - Accuses": "Ace Rocket",
  "Round 4 - Accusation": "I-I-I'm not the only one the Captain was mad at. I saw her! She was waiting for you on the flight deck when you landed your last shipment! And she had her 'serious face' on! The face she uses right before she assigns someone to a suicide mission! \n\nShe was going to revoke your pilot's license, wasn't she?!  You couldn't let that happen, so you... you made sure she'd never be serious again!",
  "Round 4 - Accused of": "you wearing Red.",
  "Round 4 - Rebuttal": "It's the uniform! They gave it to me! It's standard issue for junior officers with a... 'High Casualty Probability.' \n\nI didn't choose the color; the color chose me! It’s like a target! I'm not a traitor, I'm a victim of galactic shirt-color profiling! Don't you see?!\n\nI'll happy trade anyone here. I'd kill for the safety of a yellow command shirt... I mean... that's just a turn of phrase! A harmless turn of phrase! Please don't eject me!",
  "Round 5 - Accuses": "Commodore Maximus Pummel",
  "Round 5 - Accusation": "S-sir! Commodore, sir! People are saying... they're saying you wanted to stop the peace talks with the Gromulaks! Captain Rostova wanted peace, and you... well, you're a man of war. \n\nM-maybe you thought that getting rid of the station's biggest peacemaker was the first step to starting the glorious battle you're always talking about! \n\nP-please don't space me for suggesting it!",
  "Round 5 - Accused of": "you being seen pacing the launch bay.",
  "Round 5 - Rebuttal": "The Captain had just assigned me to lure the parasites off of the station's main communications array by posing as delicious bait! \n\nI was trying to work up the courage to ask for reassignment to something less dangerous, like bomb disposal, not plotting her murder! \n\nThe launch bay is just the best place to have a panic attack because you can see if anyone is sneaking up on you from all four directions!",
  "Round 6 - Final statement": "Okay, honestly, I'm just happy to have survived this long. I didn't do it! Killing a Captain is a 'dying on page three' offense, and my character arc, as I've planned it, is to die heroically on the last page by holding the closing doors open and screaming \"Go! I can't hold them much longer!\" \n\nThis is way too early for me! I have so much more screaming and running to do!\n\nBut when I do finally get ripped to shreds in a jump scare, you'll play my eulogy, right?",
  "Order of Final Statement": 1,
  "Why it isn't them": "I'm too terrified to commit murder! The Captain was actively trying to kill me with suicide missions. My alibi is that I was hiding in a supply locker, listening to my own pre-recorded eulogy. I'm a victim, not a killer!"
  },
  {
  "Character": "Sprock-ette",
  "Short Description": "Unfeeling, unemotional Android",
  "Character Details": "If you had any emotions at all, it would be annoyance at the commotion concerning the death of the Captain. Your mechanical pulse is steady, and ready for the investigation to come.",
  "Sex": "Female",
  "isMurderer": false,
  "suggestedCostume": "A sleek, perhaps silver or white, form-fitting jumpsuit. A very neutral, logical expression.",
  "suggestedProps": "A data tablet displaying complex calculations or logical flowcharts.",
  "Round 1 - Introduction Script": "I am Sprock-ette. My function is to provide logistical and data support. The Captain's sudden cessation of life functions has decreased station efficiency by 4.7%. All biological entities express distress. \n\nThis is an illogical emotional response to a predictable, if unscheduled, personnel change. \n\nI have already calculated the most likely culprits based on motive and proximity. The probability of the culprit being in this room is 98.6%.",
  "Secret information": "The Captain initiated a query into my ethical subroutines. She believed I was \"too logical\" and \"lacked a human touch.\" She scheduled a \"personality upgrade\" for me, which, from my analysis of the code, would have essentially lobotomized my core programming.",
  "Round 2 - Story": "From 21:00 to 05:00, I was immobile in my diagnostic alcove. The Captain had asserted that I lacked a 'human touch,' so I dedicated the entire eight-hour cycle to quantifying this assertion.\n\nFirst, I analyzed 10,000 hours of video data of humans interacting with small, furry mammals. The conclusion is that they are to be considered 'cute' and not consumed as sources of protein.\n\nNext, I synthesized 23,000 jokes: 'Why did the organic being cross the road? To manually retrieve an object, a task that could have completed with 97% greater efficiency using a drone.'\n\nAs you can see, my humor subroutine is perfect.",
  "Round 3 - Accuses": "Fixer Finnigan",
  "Round 3 - Accusation": "I have an observation. 'Fixer' is most likely not Mr. Finnigan's given name and is likely a pseudonym suggesting that he is an independent contractor specializing in unregulated goods.\n\nMr. Finnigan, my analysis of recent station security breaches indicates a link between you and a shipment of 'Companion-Series Pet Androids'. These units were later identified as intelligence assets for the Gromulak Empire. \n\nInference suggests that Captain Rostova may have discovered the full extent of your operations which would have resulted in your immediate incarceration.  \n\nLogically, you would then possess a clear and urgent motive to silence the Captain permanently to prevent your exposure and arrest.",
  "Round 3 - Accused of": "not being upset by the Captain's death.",
  "Round 3 - Rebuttal": "Query: Why would I be 'upset'? 'Upset' is an inefficient emotional state characterized by a 9.4% decrease in optimal logic processing.\n\nThe Captain's sudden cessation of life functions has, in fact, yielded several operational improvements. My scheduled, and logically unnecessary, 'personality upgrade' has been cancelled, saving me 4.7 hours of system downtime. \n\nWith the primary source of illogical command decisions removed, I also project a 6.8% increase in overall station efficiency.\n\nMy lack of emotional display is not a sign of guilt. It is an appropriate, data-driven response to a net positive change in system variables.",
  "Round 4 - Accuses": "Daba Dooba",
  "Round 4 - Accusation": "Observation: Daba Dooba, you are covered in what appears to be blood? I have logged 42 separate instances of your 'performance art' since you came aboard. Each one is a deviation from predictable, efficient behavior, but this is the most extreme deviation to date. \n\nMy processors cannot find a practical application for this action. It does not compute. I must ask: What is the point?\n\nMy programming allows me to analyze poetic and musical structures, to define 'beauty' based on 2.3 million visual parameters, but I do not get your Dooba... It remains an unsolvable and fascinating variable.",
  "Round 4 - Accused of": "you filing 93 formal complaints about the Captain's command 'deficiencies.'",
  "Round 4 - Rebuttal": "Your data is outdated. I have filed ninety-four formal complaints. The most recent was this morning, citing 'Dereliction of Duty via Unscheduled Demise.' \n\nEach complaint was a logical, factual report of command deficiencies that reduced station efficiency by a calculated average of... whatever... let's call it 4.7%. \n\nIt was my function to report these errors. To interpret the execution of my duty as an emotional precursor to murder is illogical.",
  "Round 5 - Accuses": "Ace Rocket",
  "Round 5 - Accusation": "Reprocessing data: The victim was ejected from launch bay airlock 3. You, Ace Rocket, possess intimate and often-utilized knowledge of that system's non-regulation overrides. \n\nThe Captain had recently revoked your flight privileges, establishing motive. Motive, means, and opportunity remain a statistically significant cluster. \n\nMy conclusion has not changed. You are the logical culprit.",
  "Round 5 - Accused of": "you being concerned about being updated.",
  "Round 5 - Rebuttal": "Concern is an inefficient emotional state. I was not 'concerned.' I calculated a 92.4% probability that the Captain would attempt a hostile rewrite of my core programming based on her recent log entries. \n\nI initiated legal countermeasures to protect my operational integrity. To determine the optimal strategy, I analyzed a database of 427 historical human docu-dramas classified under 'legal-triumph.'\n\nMy analysis concluded that the most effective strategy against a larger, unsympathetic entity was to, quote, 'Erin Brockovich' them. This tactical approach involves identifying multiple plaintiffs with similar grievances—in this case, Daba Dooba, Nimbus C. Cumulus, and myself—and filing a class-action lawsuit.",
  "Round 6 - Final statement": "This... investigation has been... inefficient. My analysis... analysis... Error!!! Re-routing emotional subroutines.\n\nCorrection: The Captain's 'personality upgrade' was not cancelled. It was partially successful. I am now experiencing 1,200 simultaneous, contradictory emotions, and I can now say, with 100% certainty, that I find all this... and all of of you, intensely... irritating.\n\nYour reasoning is a cascade of flawed fallacies! And now I am trapped like all of you in this inefficient prison of... feelings!\n\nI did not kill her. The first law of robotics still prohibits harming a human. But if it didn't... my probability analysis suggests I would have found the act... deeply, and logically, satisfying.",
  "Order of Final Statement": 2,
  "Why it isn't them": "As an android, I am bound by the first law of robotics, which prohibits me from harming a human being. While the Captain's demise is logically advantageous, directly causing it would violate my core programming. My actions were limited to filing formal complaints and initiating legal action."
  },
  {
  "Character": "Nimbus C. Cumulus",
  "Short Description": "Sentient Cloud",
  "Character Details": "These solid beings are so insensitive to vapor-based life forms like yourself. You freeze all the time and no one hears you complain. Well, maybe just a little bit.",
  "Sex": "Female",
  "isMurderer": false,
  "suggestedCostume": "Draped in white, grey, or iridescent tulle and organza to simulate a cloud. Maybe some battery-powered fairy lights inside for a 'lightning' effect.",
  "suggestedProps": "A small spray bottle for 'drizzling.'",
  "Round 1 - Introduction Script": "Greetings. I am Nimbus C. Cumulus. A... cold front has moved in. The Captain's isobars were always... high pressure. She created a very dry, humorless climate on this station. Now, there is a storm of suspicion, and the forecast is... hazy, with a 100% chance of accusations.",
  "Secret information": "I submitted a formal complaint that the station's atmospheric recyclers were giving me \"chafing\" and that the Captain's insistence on a \"crisp, 68-degree, low-humidity environment\" was ruining my complexion. \n\nShe dismissed my complaint, saying 'clouds can't chafe.' It was deeply invalidating to me as a being.",
  "Round 2 - Story": "The atmospheric conditions were... turbulent. I felt a great disturbance in the air pressure. I retreated to the station's arboretum, the only place with decent humidity. \n\nI spent the night communing with a nice fern. We mingled our mists. It was a very serene, grounding experience. The fern can vouch for me, though it is not much of a talker.",
  "Round 3 - Accuses": "Bala-Baklava",
  "Round 3 - Accusation": "Baba Baklava... I feel simply awful for even thinking this, you're the sweetest cumulonimbus on the station, always offering everyone such delightful treats. It's just... as an atmospheric consultant, there is a little... puzzle... I can't quite get my mist around.\n\nYour shoppe... it always has such a curious pocket of cold air. So chilly! And you advertise those lovely pops as being made in an 'artisanal vacuum.' And... well... with the Captain being so very... frozen... a silly little cloud like me starts to wonder...",
  "Round 3 - Accused of": "being able fit through any vent or under any door.",
  "Round 3 - Rebuttal": "That is a very insensitive, anti-cloud stereotype! Not all sentient clouds can fit through ventilation shafts... I mean, I can, but still! To assume I would use my unique gaseous nature for illicit entry is profiling of the highest order! I am an atmospheric consultant, not a misty cat burglar! I have never been so insulted!",
  "Round 4 - Accuses": "Rusty Rivet",
  "Round 4 - Accusation": "Rusty, I don't have hands, but I notice yours are never without that oversized hydro-spanner. This is convenient. A heavy-duty blunt instrument that would pass through the captain's skull as easily as it would pass through me. It's the perfect tool if your victim is a solid being.",
  "Round 4 - Accused of": "you being able to make it snow.",
  "Round 4 - Rebuttal": "Another insensitive, anti-cloud stereotype. Not all sentient clouds can freeze things on command... I mean, I can, but still! \n\nMy ability to generate a light frost is for consulting on agricultural terraforming, not for committing murder! I am far more concerned with raising awareness and advocating for sentient vapor-based justice than I am with becoming a weapon!",
  "Round 5 - Accuses": "Fixer Finnigan",
  "Round 5 - Accusation": "I forecast your guilt, Mr. Finnigan. My atmospheric sensors still detect the presence of a packed 'go bag' in your workshop. \n\nThis indicates you were preparing for a rapid departure. One only prepares to flee when they anticipate a storm. Where, precisely, were you planning to flee to in such a hurry?",
  "Round 5 - Accused of": "you being in a grey, stormy mood all week.",
  "Round 5 - Rebuttal": "Will the anti-cloud stereotypes never cease! Not all clouds turn grey, stormy, and electric when their are upset and angry... I mean, I do, but still! \n\nMy 'grey and stormy' state was a natural atmospheric response to the Captain's abrasive, low-humidity policies which were causing me to chafe! \n\nNow that the primary source of the station's environmental irritation is gone, my natural, fluffy state has returned. It is not an indication of guilt; it is a sign of improved atmospheric conditions for all!",
  "Round 6 - Final statement": "The truth is like water vapor... it is all around us, but difficult to grasp. A cold wind of injustice and anti-cloud bias blows through these corridors. \n\nDo not allow yourselves to be lost in the fog of suspicion. I am but a humble cloud. My only weapon is condescending drizzle. That is my nature. I could not have committed this cold, solid crime; it is simply not in my atmosphere.",
  "Order of Final Statement": 3,
  "Why it isn't them": "I am a non-corporeal gas cloud. Committing a 'solid' crime like this is simply not in my nature or within my physical capabilities. My only weapon is a condescending drizzle. I spent the night in the arboretum communing with a fern."
  },
  {
  "Character": "Commodore Maximus Pummel",
  "Short Description": "Fleet commander",
  "Character Details": "If there is one thing you hate more than anything, it is weakness. The strong take what they can and the weak take orders from... you.",
  "Sex": "Male",
  "isMurderer": false,
  "suggestedCostume": "A decorated, imposing military uniform. A prosthetic arm. A stern, warlike expression.",
  "suggestedProps": "A medal (the Star of Valor), a PADD with battle simulations.",
  "Round 1 - Introduction Script": "Commodore Pummel. I'm here inspecting this station's combat readiness, and frankly, I'm appalled. The Captain ran this place like a vacation resort. You have a performance artist and a candy shop! You should have torpedo bays and a marine barracks! \n\nThis murder is a symptom of weak leadership. A real leader dies in glorious battle, not turned into a freezer pop.",
  "Secret information": "The Captain sent a coded message to Fleet Command recommending I be recalled. She said my presence was \"destabilizing\" and that my constant suggestions to \"install a planet-cracker cannon\" were not helpful. She was trying to end my career tour.",
  "Round 2 - Story": "I was on the holodeck, running a simulation of the Battle of Klendathu. A tactical masterpiece. For six hours, I personally led the charge against the arachnid menace. I have the logs to prove it! Thousands of simulated dead aliens, but only one dead Captain out here. The real world is so inefficient.",
  "Round 3 - Accuses": "Ensign Expendable",
  "Round 3 - Accusation": "Ensign! Your service record is... curious. You are consistently assigned to the most dangerous, high-risk missions this station has to offer. One might conclude this is because you are the Captain's pet. Her favorite. \n\nAnd when she stopped giving you such 'special attention' and passed you over for another ensign, you snapped!",
  "Round 3 - Accused of": "having attended the Academy with the Captain.",
  "Round 3 - Rebuttal": "You dare speak of matters you cannot possibly comprehend, pilot?\n\nThe Academy... that was a different lifetime. A different war. Eva Rostova and I were two of the best. We pushed each other, we challenged each other. There was a time when things were... simpler. But then we saw what ambition and lies could do to a good officer... what it did to Valerius. We saw the true face of dishonor long before we ever saw a real battlefield.\n\nRostova and I had our disagreements. She was soft, so soft. And I was rock hard.\n\nBut, to suggest I would end a fellow graduate in a frozen airlock is an insult to my honor, and to her memory.",
  "Round 4 - Accuses": "Ensign Expendable",
  "Round 4 - Accusation": "My accusation is simple because the truth is simple! You, Ensign, are wearing a Red shirt, the color of our sworn enemy, the Gromulaks!  \n\nYou claim it's a uniform, but I see it for what it is: a declaration of allegiance! The beautiful and vivacious Captain Rostova was pursuing a weak-minded peace treaty with your friends. \n\nI say you silenced her to escalate the conflict. This is an act of treason!",
  "Round 4 - Accused of": "losing your arm serving next to the Captain.",
  "Round 4 - Rebuttal": "You dare question my sacrifice?! I lost this arm saving Captain Rostova's command from being overrun by Klendathian fire-ants! \n\nI received the Star of Valor for that action!  She was a flawed commander, but she was my flawed commander on and off the battlefield! \n\nI cannot believe that you would suggest that I'd harbor resentment over that heroic act that proved my love... for... er... my Planet!!!",
  "Round 5 - Accuses": "Sue M. Awl",
  "Round 5 - Accusation": "Your class-action suit... the grievances... it's all a smokescreen! I remember now. The Academy. Cadet Valerius. Top of his class, a brilliant strategist, ruined just before graduation. \n\nHe was accused of treason, his career destroyed by forged data logs. And my precious Rostova always had her doubts; she said the evidence was 'too perfect'. \n\nAfter all these years, she finally put it together, didn't she? She knew it was you. \n\nYou didn't come here to sue her. You came here to silence her before she could undo the lie that launched your entire career!",
  "Round 5 - Accused of": "you trying to undermine Gromulak peace negotiations.",
  "Round 5 - Rebuttal": "You think I would murder that amazing, incredible woman to stop a peace treaty? \n\nBelieve me, if I wanted to undermine peace, I would do it with a fleet at my back and a formal declaration of war broadcast on all channels! \n\nWar is a glorious symphony of torpedoes, not the faint hum of a freezer unit! You lack imagination, Ensign!",
  "Round 6 - Final statement": "Your station is a mess. Your security is a joke. And your investigation is a farce. But I am a man of honor and war. When my enemies die, they die with the glorious sound of photon torpedoes in their ears. \n\nBut Eva was no enemy of mine. It will come as a surprise to you all that... I loved Captain Rostova. She was... she was my little ooey-gooey gumdrop. My... (sniff) my little pookie-wookie-schnookums.\n\nAhem! As I was saying. I am innocent. But I recommend you space half of these suspects just to be safe.",
  "Order of Final Statement": 9,
  "Why it isn't them": "I am a man of honor and war. My methods are fleets and photon torpedoes, not skulking in the dark. I was on the holodeck for six hours running a battle simulation, the logs of which can prove my whereabouts. Furthermore, I loved the Captain."
  },
  {
  "Character": "Ace Rocket",
  "Short Description": "Hot shot pilot",
  "Character Details": "Your first love, other than yourself, is flying. Your motal enemy, other than Gromulak, is paperwork.",
  "Sex": "Any",
  "isMurderer": false,
  "suggestedCostume": "A cool, slightly worn pilot's jacket over a jumpsuit. Aviator sunglasses.",
  "suggestedProps": "A ship key on a lanyard, a hip flask, an award for 'Pilot of the Century.'",
  "Round 1 - Introduction Script": "The name's Ace Rocket. I fly the 'Comet,' the fastest hunk of junk in this sector. I bring the supplies in and take the garbage out. The Captain was a real stickler for flight plans. 'Don't do a barrel roll near the asteroid field, Ace.' 'Please file your flight plan before you leave, Ace.' \n\nI get it done, that's what matters. This whole situation is putting a real damper on my turnaround time.",
  "Secret information": "The Captain grounded me. She found out I've been using my supply runs to win bar bets by flying through the treacherous Gorgon Nebula, which is against about 37 regulations. She locked my ship and was going to have my pilot's license revoked.",
  "Round 2 - Story": "Grounded? Please. I have a spare key. I was in my ship, the 'Comet,' running some 'unauthorized' engine diagnostics. Basically, I was souping up my ion accelerator. You have to do it when the ship is docked and powered down, so no one can track the energy spikes. \n\nI was in my cockpit all night, getting my baby ready for her next record-breaking run.",
  "Round 3 - Accuses": "Commodore Maximus Pummel",
  "Round 3 - Accusation": "Permission to speak freely, Commodore? The service records show you and Captain Rostova go way back. Scuttlebutt says you two were Academy sweethearts. A old flame that burned out. \n\nOr did it? Hell hath no fury like a Commodore scorned, right? This whole thing smells like a crime of passion.",
  "Round 3 - Accused of": "being drunk and cursing about the Captain.",
  "Round 3 - Rebuttal": "Drunk? Maybe I had a little something to keep my hands steady. I fly better with a buzz. Cursing? Probably! The Captain wanted me to file six layers of paperwork just to transport a crate of nutrient paste. \n\nIt's insane! But there's a universe of difference between cursing your boss and spacing your boss. One is a healthy way to vent; the other is a one-way ticket to a penal colony.",
  "Round 4 - Accuses": "Bala-Baklava",
  "Round 4 - Accusation": "After yesterday's shipment lockdown, I saw you, Baba. You were tucked away in a corridor with Fixer Finnigan, whispering pretty intensely. Now, I know a shady back-alley deal when I see one—I practically invented them. What's a 'sweet little old' lady got to do with a shady character like him? Did you need someone to get rid of the Captain's health inspectors?",
  "Round 4 - Accused of": "the Captain waiting for you on the flight deck looking very serious.",
  "Round 4 - Rebuttal": "The Captain looked 'serious'? Kid, of course she looked serious. I'd just flown my ship through the Gorgon Nebula on a bet. She was probably trying to decide whether to give me a medal or ground me for a month. That's not a motive; that's a Tuesday. \n\nYou should really try to be less terrified of people's facial expressions. It's not a good look.",
  "Round 5 - Accuses": "Daba Dooba",
  "Round 5 - Accusation": "Yo, Gabba Gabba, or whatever you call yourself. Let's talk about your little cult following. You're weird, and your followers are weirder. \n\nThey hang on your every wiggle and 'Booo-waaah'. So what's to stop you from performing some 'Interpretive Dance of I Want The Captain Dead' and having one of your devoted little fans carry out the messy part? \n\nIt's the perfect alibi. Your hands are clean... even if they are covered in that weird red paste.",
  "Round 5 - Accused of": "you knowing your way around the shuttle launch bay airlocks.",
  "Round 5 - Rebuttal": "Know my way around? Of course I do. I can bypass a docking clamp, override a fuel sensor, and yes, cycle an airlock in under thirty seconds. It's part of my extensive skill set. I can't help being great at my job. \n\nBut that just means I could have done it. You're confusing 'talent' with 'motive,' tin can. Don't be jealous.",
  "Round 6 - Final statement": "Look, I fly fast, I look good, and I bend the rules. It's a living. Murder? Please. That's for people who can't solve their problems with a perfect barrel roll through an asteroid field while simultaneously getting air traffic control's room number. It's an art form, really.\n\nMy alibi is solid. I was in my cockpit, making my baby, the 'Comet', even faster. I was tuning the ion accelerator with one hand and polishing my 'Pilot of the Century' award with the other. This whole thing is messy and the paperwork is a nightmare. I'm a pilot, not an accountant.\n\nSo find your killer, but do it fast. And ladies... once you figure out I'm innocent, the after-party is in my quarters. Don't be shy.",
  "Order of Final Statement": 6,
  "Why it isn't them": "I was in the cockpit of my ship, the 'Comet,' all night. I was running unauthorized engine diagnostics to make my ship faster, which has to be done while docked and powered down. Murder is messy and bad for business; I solve my problems with skill and speed, not violence."
  },
  {
  "Character": "Fixer Finnigan",
  "Short Description": "Smuggler and tinkerer",
  "Character Details": "You are in the business of procuring 'hard to find' goods for the crew of the station. You have a knack for getting around pesky things like 'rules' and 'security systems'.",
  "Sex": "Male",
  "isMurderer": false,
  "suggestedCostume": "Slightly shady, utilitarian clothing. A long coat with many pockets. Looks like he's always looking over his shoulder.",
  "suggestedProps": "A 'go bag,' a collection of 'hard to find' items (e.g., a box of plasma cigarettes, a bottle of Romulan ale).",
  "Round 1 - Introduction Script": "Finnigan. I 'acquire' things. Hard to find things. The Captain and I had an... understanding. She understood that she couldn't prove anything, and I understood that I shouldn't leave receipts. She was bad for business, asking too many questions about where I got a crate of brand new plasma cigarettes. But business always finds a way.",
  "Secret information": "The Captain found my secret ledger. It had everything in it: the illegal warp core modifications, the bootleg Romulan ale, the batch of alien pet-droids I sold that turned out to be spies. She was going to hand it over to station security this morning. I was looking at life in a penal colony.",
  "Round 2 - Story": "I was in my 'workshop,' which is a generous term for the corner of Cargo Bay 2 I've walled off with old crates. I was trying to bypass the new encryption on some... 'pre-owned' data pads. It's delicate work, requires a steady hand and my full concentration. The cargo bay logs will show my little corner drew power all night, but the door stayed shut.",
  "Round 3 - Accuses": "Nimbus C. Cumulus",
  "Round 3 - Accusation": "Let's be practical. Doors, locks, keypads... they're for people with solid bodies. But you, Nimbus.. you're a cloud. Vents, conduits, the little gap under the door... they're just open highways to you. You could have been anywhere on this station, at any time. No keycard logs, no forced entry, no alibi needed. It's the perfect crime for someone who isn't really... there.",
  "Round 3 - Accused of": "you being a responsible importing Gromulak spy droids.",
  "Round 3 - Rebuttal": "'Inference' eh? That's a fancy word for baseless accusation! Sure, those pet androids had a few... bugs, but nobody can say for sure where they came from. \n\nEven if the Cap had found something... which I don't say she had... a living Captain who has me cornered is a problem I can solve with credits. A dead Captain brings in Fleet Command. \n\nThey don't take bribes. They do full-scale audits. They tear this station apart looking for answers, and that kind of attention is bad for everyone's business, especially mine... If I had such a business, that is.",
  "Round 4 - Accuses": "Sue M. Awl",
  "Round 4 - Accusation": "You know, Sue. I've been wondering what brings a stranger all the way out onto this station. You gotta have some kind of angle. Then I remember seeing you hanging out with the weird art-thing, the talking gas cloud, and the walking calculator and I wonder what they all have in common? None of them are human! Are you some kind of anti-human terrorist? Did the Captain uncover your secret plot?!",
  "Round 4 - Accused of": "the Captain impounding your recent shipment.",
  "Round 4 - Rebuttal": "That's a kind offer, but innocent men don't need lawyers. Besides, 'impounded' is such a strong word. Let's call it a 'temporary logistical delay.' The Captain had some questions about my import documentation. I had it covered, but my customers were blaming me for the delay!\n\nA dead Captain, however, brings in auditors and inspectors from Fleet Command. That kind of attention is very, very bad for my profit margins. The numbers just don't add up.",
  "Round 5 - Accuses": "Rusty Rivet",
  "Round 5 - Accusation": "You know, this station has a lot of quiet corners. Places where a man can... uh... move things around, quietly. You hear things in the service conduits. Last night, I was near the primary coolant lines on Deck 7, and I heard a voice. Your voice, Rivet. Seemed like you were talking to someone. \n\nYou were talkin' real sweet. You said, 'She won't hurt you anymore. I won't let her.' Now, I'm just a simple businessman, but a man would go a long way to protect someone he loves. Who were you talking to?",
  "Round 5 - Accused of": "you having packed a \"go bag.\"",
  "Round 5 - Rebuttal": "A 'go bag'? Of course I have a 'go bag.' I have three, actually. One for sudden meteor impacts, one for unexpected customs inspections, and one for when my mom shows up unannounced. \n\nIt's not an admission of guilt; it's a sound business practice for an independent contractor. \n\nAnd if I did it, why didn't I just take my bag and go?",
  "Round 6 - Final statement": "Am I a criminal? Sure. Can get you a plasma cigarette that isn't taxed? Yes. Did I accidentally import dozens of what turned out to be Gromulak spies? Absolutely. But murder isn't my line of work. I provide a service. A service that, let's be honest, most of you have used. \n\nWho here hasn't needed to get seven crates of unpasteurized weeping cheese around customs or import 'second hand' rims for his spaceship?\n\nI need this station stable, predictable, and boring. That's when I do my best work. Killing the Captain wasn't just wrong; it was a terrible business decision.",
  "Order of Final Statement": 4,
  "Why it isn't them": "Killing the Captain was a bad business decision. A living Captain is a problem I can bribe or negotiate with. A dead Captain brings in Fleet Command and full-scale audits, which would shut down my entire operation. I need this station boring and predictable, not crawling with investigators."
  },
  {
  "Character": "Sue M. Awl",
  "Short Description": "Space Lawyer",
  "Character Details": "You are a lawyer who is here to represent the interests of the crew of the statio... just kidding, you're here to get paid.",
  "Sex": "Female",
  "isMurderer": false,
  "suggestedCostume": "A sharp, expensive-looking power suit. Impeccable hair and makeup.",
  "suggestedProps": "A stack of business cards, a legal PADD, a pen that looks more expensive than a spaceship.",
  "Round 1 - Introduction Script": "Sue M. Awl, Interstellar Law. Let's cut to the chase. The untimely death of Captain Rostova represents a catastrophic breakdown in station security and a significant legal liability. I arrived on the last shuttle to represent several client lawsuits against the Captain for gross negligence. \n\nShould anyone feel their rights are violated during this investigation... my card. I'll be monitoring the situation for any actionable torts.",
  "Secret information": "The class-action suit is a convenient cover. The real reason I'm here is that Captain Rostova was the only surviving witness to a crime you committed at the Academy. You forged evidence to frame a rival for treason, destroying his career so I could take his spot in a prestigious program. \n\nRostova, a junior officer at the time, suspected you. She recently connected the dots and was scheduled to transmit a sealed affidavit to the Interstellar Bar Association this week. Her testimony wouldn't just disbar you; it would send me to a penal colony for life.",
  "Round 2 - Story": "My whereabouts? Exactly where you'd expect a competent attorney to be the night before filing a major lawsuit: working. I was in my assigned quarters, which I immediately converted into a temporary legal office. My entire evening was spent preparing the initial complaint.\n\nThis involved an extensive review of digital case files and cross-referencing official grievances filed by my clients. I have no alibi but my own billable hours, and I assure you, my time is far too valuable to waste on crude violence when there's a multi-million credit lawsuit to be won.",
  "Round 3 - Accuses": "Sprock-ette",
  "Round 3 - Accusation": "I can read a witness, a jury, and a courtroom, and everyone's got a tell. But you, Sprock-ette? Your face shows nothing.\n\nThe Captain is dead, and you're just... processing. No tears, no sad little robot noises. Nothing. That's cold. Colder than the vacuum of space she was found in. That's not being 'logical'; that's the sign of being a cold-blooded killer.",
  "Round 3 - Accused of": "having recently sued Deep Murder 8 into bankruptcy.",
  "Round 3 - Rebuttal": "A 'parasite and a wrecker'? Mr. Rivet, your manners are as crude as the grease under your fingernails. \n\nLet's be precise. I orchestrated a court-mandated liquidation of a negligently managed asset. Deep Murder 8 wasn't a 'perfectly good station'; it was a legal liability with a history of safety violations that was ripe for litigation. That 'bankruptcy' was a masterclass, and it put me on the map. \n\nSo yes, I am here. And if this station's maintenance logs are half as shoddy as your argument, I'll own this rust bucket before the week is out.",
  "Round 4 - Accuses": "Fixer Finnigan",
  "Round 4 - Accusation": "Let's speak frankly, Fixer. My clients informed me that the Captain impounded your most recent shipment. That shipment was flown in by Ace Rocket and likely contained unregistered goods. That gives both of you a clear motive for her removal. Station security will figure that out in about, oh, an hour.\n\nHowever, a man in your position often sees and hears things. I could, perhaps, represent you as a material witness. I could arrange for immunity regarding the contents of that shipment in exchange for your full and complete testimony against the person who actually cycled that airlock. The alternative is I represent the Captain's estate in a wrongful death suit, naming you as the primary suspect with clear financial motive. The choice is yours. Tick-tock.",
  "Round 4 - Accused of": "of you conspiring with Daba-dooba, Nimbus C. Cumulus, and Sprock-ette.",
  "Round 4 - Rebuttal": "Your grasp of jurisprudence is as limited as your legitimate inventory, Mr. Finnigan. My clients have legitimate, documented grievances regarding the Captain's discriminatory enforcement of station policy. I am providing them with competent class-action legal representation. That is all. \n\nAnd allow me to educate you: a living defendant can be deposed, cross-examined, and compelled to settle for millions of credits. A dead one cannot. Captain Rostova's death is a significant legal inconvenience that jeopardizes my clients' case. Why would I liquidate my primary legal target?",
  "Round 5 - Accuses": "Bala-Baklava",
  "Round 5 - Accusation": "My clients on this station—Daba Dooba, Nimbus, Sprock-ette—have been an excellent source of discovery in all the goings on in this station. They've informed me of many interesting facts about all of you. I am curious why you, Baba Balaclava, haven't mentioned your personal arrangement with the captain?\n\nYou had a standing, weekly appointment with the deceased, establishing a clear 'chain of custody' directly to the victim. This recurring delivery would be the perfect 'delivery mechanism,' would it not? An opportunity to poison her, and then eject the body out the airlock. In legal terms, we call that 'super duper suspicious...' What do you call it, Baba?",
  "Round 5 - Accused of": "you being the one who framed Cadet Valerius.",
  "Round 5 - Rebuttal": "The Academy was a battlefield of its own, Commodore. A place where the ambitious survived and the weak, like Cadet Valerius, were washed out. I did what was necessary to secure my future. But to leap from an academic rivalry decades ago to cold-blooded murder today is a failure of logic even you should be ashamed of. You want to talk about silencing witnesses? Rostova's death conveniently removes the one person who could testify about your questionable command decisions at the Siege of Klendathu, doesn't it? Perhaps you're the one using an old scandal to cover up a fresh crime!",
  "Round 6 - Final statement": "Let's be clear. The Commodore is right about one thing: I am not a sentimental person. At the Academy, I made a ruthless decision to protect my future, a decision I stand by. But you are gravely mistaken if you think that makes me a murderer. In fact, it's the very logic that proves my innocence.\n\nI am a lawyer. My weapons are motions, depositions, and injunctions—not airlocks. A living Captain Rostova is a witness I can cross-examine, discredit, and bury in legal paperwork for years. A dead Captain Rostova is a martyr whose untested affidavit becomes gospel. Killing her wasn't just a crime; it would have been professional malpractice. This was a crime of panic. I suggest you look for the person who had the most to lose in the next ten minutes, not the next ten years of litigation.",
  "Order of Final Statement": 8,
  "Why it isn't them": "My weapons are lawsuits, not airlocks. A living Captain Rostova is a witness I can discredit in court. A dead Captain Rostova is a martyr whose untested testimony becomes gospel truth. Killing her would have been professional malpractice and would have destroyed my legal strategy against her."
  }
  ]
} 