{
  "metadata": {
    "scriptId": 5,
    "title": "Murder at the No-Kay Corral",
    "version": 1,
    "description": "A thrilling murder mystery set in the Old West town of Sheriffkill Springs.",
    "setting": "Sheriffkill Springs",
    "timePeriod": "Old West",
    "difficulty": "Medium",
    "estimatedDuration": 90,
    "minPlayers": 8,
    "maxPlayers": 8,
    "targetAudience": "10+",
    "tags": "Western, Comedy",
    "author": "JJ",
    "createdDate": "7/5/2025",
    "lastModified": "7/5/2025",
    "victim": "Sheriff Chad",
    "numberOfRounds": 6,
    "backgroundAsset": "../assets/images/backgrounds/OldWestDark.png",
    "status": "Available",
    "isActive": true,
    "introduction": "Welcome to Sheriffkill Springs, a dusty frontier town where the law is as scarce as honest politicians and the secrets run deeper than a mineshaft. Tonight, the town's peace has been shattered by a most unfortunate incident.\n\nSheriff Chad, the handsome and newly appointed lawman who had been keeping order in this lawless territory, has been found dead, floating face down in a horse trough in the corral behind the Cloak & Dagger Saloon. The circumstances of his demise are as mysterious as the strange lights that have been appearing over the town.\n\nThe doors of Sheriffkill Springs have been sealed. The territorial marshal is on his way, but for now, you, the colorful cast of characters who call this town home, are trapped within these wooden walls. Each of you carries secrets, motives, and perhaps even the means to have brought about Sheriff Chad's untimely end.\n\nIt now falls to you to unravel this frontier mystery. Examine the evidence, scrutinize the alibis, and expose the hidden truths. Tonight, the greatest drama will not be on the saloon stage, but right here, among yourselves, as you determine:\n\nWho killed Sheriff Chad?"
  },
  "characters": [
    {
      "Character": "The Cactus Kid",
      "Short Description": "Polite Teen Outlaw",
      "Sex": "Any",
      "isMurderer": true,
      "suggestedCostume": "Please provide suggested costume for The Cactus Kid",
      "suggestedProps": "Please provide suggested props for The Cactus Kid",
      "Round 1 - Introduction Script": "Thank you all so kindly for letting me speak. Very nice of everone, especially you, Gigi, you is always so kind... and pretty... and nice smellin'... \n\nMy apologies, I don't mean to waste everyone's time, so I'll just come right out and say it. I done it. I killed the Sheriff. I'm the Cactus Kid and I'm a big, scary outlaw who everyone should be a'feared of. I been robbin' all those trains and such - and rustlin' cattle - and taking candy from babies. \n\nEverybody better watch out or I'll... I'll get you too! Thank you very much for listening.",
      "Secret information": "Despite your bravado, you are too good-hearted for a life of crime. Your 'crimes' consist of things like \"stealing\" Uncle Dusty's horse, only to spend hours grooming it, braiding its mane with wildflowers, and returning it cleaner than you found it. You secretly yearn for Gigi LaFlamme's attention and mistakenly believe being a 'bad boy' will impress her.\n\nYou are the murderer, though it was entirely accidental. The Sheriff had threatened to send you to a reform school far away. You pushed him which surprised him because it didn't expect you to fight back. He slipped on a bit of manure in the corral, a spooked horse kicked him, and he fell in the trough. \n\nTaking credit for killing the Sheriff is your chance to finally become the outlaw you've always dreamed of being, but you can't admit that it was an embarrassing accident.",
      "Round 2 - Story": "I... I was just mindin' my own business, see? Being a big, scary outlaw. I went into the corral because I was gonna... gonna set a trap for the Sheriff! Yeah! Like... like a tripwire for his feet. I saw him there, talkin' to himself, lookin' all big and mean, just like he always did when he was tellin' me to 'get along now!'.  \n\nSo I... I did it! Lightning flashed out of my eyes and I pushed him! Real hard! I said 'No, you get along now!' and he tripped on my outlaw trap and it killed him good!",
      "Round 3 - Accuses": "Mayor",
      "Round 3 - Accusation": "Us outlaws have got to stick together. Isn't that right Mr. Mayor? When I'm out robbin' trains and such I'm always seeing you out near Eastwood Canyon with that surveyor and plantin' stakes in the ground to mark our your secret plans. You're casin' the place for a big stagecoach robbery, am I right?",
      "Round 3 - Accused of": "you being seen grooming Dusty's horse.",
      "Round 3 - Rebuttal": "I was practicing my horse thievin' skills! A real outlaw makes sure the horse looks good so it can run fast! And the bow... that was for camoflage! Yeah! So no one would know it was a stolen outlaw horse! You're just tryin' to make me look bad 'cause you're jealous I'm a real outlaw now!\n\nSorry for yellin', Miss Bottoms, and I'm real sorry if I scared you Miss Gigi... I'd never do anything but be real nice to you... It's just... I ain't no stable boy! I'm the Cactus Kid, and I killed the Sheriff!",
      "Round 4 - Accuses": "Belle Bottoms",
      "Round 4 - Accusation": "Miss Bottoms, I'm awfully sorry to bring up what might be an awkward subject, but you said you were were busy with a 'business meeting' all night. So you must have been missing from behind the bar for a long stretch around the time... I killed the sheriff.  Your office at the back of the saloon is right next to the corral so you probably saw me do it? \n\nWell, whatever that meeting was, it sounds pretty important? Were you cooking up a conspiracy?! Do you need a good outlaw?",
      "Round 4 - Accused of": "you being sent away to school.",
      "Round 4 - Rebuttal": "Mrs. Pennyfarthing's Home for Polite and Gentle Youths?! That's not true! I was going to... um... 'Mr. Quarterdollar's Camp for Outlaw Education!' \n\nI was gonna go learn more outlaw tricks! And Sheriff Chad, he was just sayin' it was that other one 'cause he was jealous of how good I am at bein' an outlaw and how he could never catch me in a million years! He was tryin' to ruin my image! I'm the Cactus Kid, and I ain't goin' to no school! So that's why I killed the Sheriff!",
      "Round 5 - Accuses": "Gigi",
      "Round 5 - Accusation": "Miss Gigi, I apologize if I'm too forward an all, but you're always so fancy with your rings and your sparkly things. But I noticed something just now... that shiny silver ring you always wore on your left ring finger... it's gone! And, because I killed the sheriff, I knowed that he had it on him. \n\nSo is it true that you weren't going to marry him? And if so, would you marry me instead?",
      "Round 5 - Accused of": "you crying in the corral.",
      "Round 5 - Rebuttal": "Crying?! That's a dirty, rotten lie! Sorry for shouting, Mr. Mayor, sir. \n\nI wasn't crying, I was... I was just practicing my method acting! Yeah! For my next big outlaw role! A real outlaw cries when he's feeling... feelings! It makes me tougher! \n\nAnd if I was in the corral, it was to plant a distraction for the Sheriff, not to cry like a baby! I killed him, alright, but I wasn't crying about it!",
      "Round 6 - Final statement": "Alright, alright! Everybody shut up!  Sorry.\n\nI done it! I told you I did, didn't I? I'm the Cactus Kid, and I ain't no fake outlaw! Sheriff Chad, he was gonna send me to away from my uncle, said he was 'unfit.' Uncle Dusty never did nobody no harm. I just... I just wanted him to leave us alone! \n\nI was cryin in the stables because he had told me to pack my bags. And when he came back to check on me, I got so mad! I pushed him! He was so surprised , he slipped on some manure and fell down. Just then two weird lights shot across the sky in front of the horses and spooked them. One kicked him in the head and he fell into the trough.\n\nI'm sorry. I killed the Sheriff. It was an accident. But I'm still an outlaw... a crying outlaw.",
      "Order of Final Statement": 8,
      "Why it isn't them": "He did it. It was an accident."
    },
    {
      "Character": "Belle Bottoms",
      "Short Description": "Frontier Saloon Owner",
      "Sex": "F",
      "isMurderer": false,
      "suggestedCostume": "Please provide suggested costume for Belle Bottoms",
      "suggestedProps": "Please provide suggested props for Belle Bottoms",
      "Round 1 - Introduction Script": "Well, look what the cat dragged in! Y'all look like you could use a drink. Your faces look longer than a Sunday sermon on a hot day. Welcome to the Cloak & Dagger Saloon – or as I like to call it, the Jewel of the Rockies. The name's Belle Bottoms, and if you think the mayor runs this town, you've clearly had too much whiskey and I ought to cut you off. I am the Belle of this town and the keeper of all its secrets. This here establishment? It’s where deals are made, fortunes are won and lost, and legends are born. This ain't just a saloon; it's an institution... and so am I!",
      "Secret information": "You are the cunning mastermind behind the string of recent train robberies that have plagued the territory. Sheriff Chad was diligently, and foolishly, closing in on your operation, having unearthed a critical piece of evidence that could directly link the Cloak & Dagger Saloon – and by extension, you – to the heists. He was preparing to make his move, unaware that you were already aware of his investigation and his findings.\n\nAs a side-hustle, you have been stealing from Dusty's \"secret\" mine.",
      "Round 2 - Story": "Alright, listen up, because I only say this once. I was busy, very busy, the night the Sheriff up and died. This saloon, you see, it don't run itself. I had a very private, very important business meeting in the back room. You wouldn't believe the amount of paperwork involved in running the Cloak & Dagger: licensing, health inspections, auditioning and hiring certified can-can choreographers... I heard a bit of a commotion outside, horses whinnyin' and a muffled thud, like someone dropped a sack of oats. Figured it was just a clumsy stable hand, or maybe one of Dusty's 'raccoon monsters'. My mind was on numbers, not on noise. I never left this establishment until morning, and certainly not to meddle in Sheriff Chad's... affairs.",
      "Round 3 - Accuses": "Cactus Kid",
      "Round 3 - Accusation": "Cactus Kid, what's all this about you killing the Sheriff? I know you're a nice boy. I saw you out there just the other day, down by the corral, giving Dusty's old mare a real proper scrubbing. Hair braided and everything, looking mighty fine. Seems like that horse got herself a little spa day, courtesy of Sheriffkill Springs' very own... 'outlaw.' You've got a way with animals, I'll give you that.",
      "Round 3 - Accused of": "you dumping Wyatt Burp for Sherriff Chad, only for Sherrif Chad to dump you for Nurse Holliday.",
      "Round 3 - Rebuttal": "Sheriff Chad and me? Sure he was fun to look at, but I have bigger things to worry about than a puffed-up prettyboys with a stars on his broad, burly, beefy chest. I'm a business woman who's got more brains that twenty lawmen put together. Besides, I got plenty of other men in my life.",
      "Round 4 - Accuses": "Phineas Phileas Fogg Jr.",
      "Round 4 - Accusation": "Mr. Fogg, your presence in Sheriffkill Springs has been, shall we say, enlivening. From behind my bar I hear lots of things, lightning strikes on clear days, billowing clouds of sulphurous smoke, and one of the new rumors about town is that you've been tinkering on a strange 'metal carriage', with no horses, black wheels, and flames painted on it! Sounds devilish! What exactly is this contraption, and what is its true purpose? Is it merely a 'scientific experiment,' or is it a death machine?",
      "Round 4 - Accused of": "your saloon backing up to the Corral and you being unaccounted for at the time of the murder.",
      "Round 4 - Rebuttal": "Aw, aren't you sweet! I'm sorry I didn't see your dastardly murder and, unfortunately, I don't have a robbery gang I can invite you to join. Yes, I was away from the bar, but I have staff to help pour the shots. If you all must know, I was meeting with our Mayor here to discuss a... joint venture of ours in Eastwood Canyon. These things require absolute discretion and cannot be handled from behind a noisy bar.",
      "Round 5 - Accuses": "Wyatt",
      "Round 5 - Accusation": "Wyatt... darlin'... word travels faster than a speeding bullet in this town. I heard Sheriff Chad used those rippling biceps of his and hauled you in for a little chat the night before he would up in that trough. What exactly was so urgent that the lawman needed to 'question' you, and right then? I'd be mighty interested to know what kind of... information you two exchanged. I hope you remembered where your loyalties lie, old friend, and didn't let any secrets slip from those whisky-soaked lips of yours.",
      "Round 5 - Accused of": "you being the secret leader of the \"Train Bang Gangers.\"",
      "Round 5 - Rebuttal": "Poor empty headed Gigi. I hired you for your looks, not your brains. The 'Train Bang Gangers'? Sounds like something from a penny dreadful. \n\nMy business meetings are about expanding my empire, not about robbing trains. Some people just love to create drama, but I'm more interested in profiting from it. \n\nTell you what, mademoiselle... so long as you keep bringing in those lovesick fans of yours, and they keep buyin' my whiskey, and I'll be the bigger woman and let you stay employed in my legitimate business!",
      "Round 6 - Final statement": "Alright, folks, listen up. You wanna know what I was really doing in that back room? I was planning the next big train robbery with my associates. That's right, I'm the beautiful brains behind those heists. \n\nThe Sheriff was sniffin' around my operation, sure, but he was more useful alive. I had intel through my 'man on the inside'. Sheriff Chad was pretty, but he sure was dumb. Dumb enough to let this hot mama slip through his fingers for some dental hygenist. And dumb enough to miss what was right in front of his nose all this time!\n\nMy hands were clean, I was busy planning a future haul, not muckin' up a well-oiled operation.\n\nOh, yeah, I was stealin' from Dusty's mine, too, because why not?!",
      "Order of Final Statement": 4,
      "Why it isn't them": "Had an informant on the inside. Didn't know that the Sheriff was closing in."
    },
    {
      "Character": "Wyatt Burp",
      "Short Description": "Washed-up, Drunkard Ex-lawman",
      "Sex": "M",
      "isMurderer": false,
      "suggestedCostume": "Please provide suggested costume for Wyatt Burp",
      "suggestedProps": "Please provide suggested props for Wyatt Burp",
      "Round 1 - Introduction Script": "[Hiccup!] Alright, settle down, you varmints! I'm Deputy Wyatt Burp, and don't you forget it! I used to be this here town's sheriff and the fastest draw west of the Mississippi, before... well, before… [hiccup] ...a certain tragic and mysterious calamity changed my life forever. I suppose some new Sheriff thinks he's goin' to ride in here an' take over, but I'll be the one askin' questions, and I'll get to the bottom of this before he even saddles his horse. [Hiccup!] Y'all want act all watery-eyed 'cuz the sherrif took a swim? Well, one 'a you done it, and there's a new sherrif in town to find out who! I’m still sharp as a tack! Don't you go thinkin' I'm not. I'm still the law, even if the law's a bit... [hiccup] spirited tonight.",
      "Secret information": "You have been secretly operating as an inside man for Belle Bottoms' train robbery gang, using your position as Deputy to feed them crucial information. However, you recently had a change of heart – and were the one who secretly tipped off Sheriff Chad about Belle's gang and their activities, hoping for revenge on Belle and perhaps to win back some respect.\n\nTo make ends meet, you have been stealing from Dusty's \"secret\" mine.",
      "Round 2 - Story": "[Hiccup!] Right, my story. I was performin' my deputorial duties, naturally. Just a routine patrol, keepin' the peace, checkin' on things. Little bit a' whiskey to keep me warm, you know? I decided to investigate this... suspicious pile a' hay near the corral and when I get down on my belly to have a look see, it were so cozy and peaceful I figured I'd just shut my eyes for a few winks. Next thing I knew it was morning and I had a blazing headache!",
      "Round 3 - Accuses": "Phinneas",
      "Round 3 - Accusation": "Phineas, you and your fancy gizmos, always makin' strange noises outta that shack you call a lab! Floating lights, you say, Dusty? I bet they're comin' straight from this fella! And all those other... technological nuisances that have been plaguein' Sheriffkill Springs? That confounded flickering street lamp, the saloon's clock runnin' backwards last Tuesday, that blasted telegraph line hummin' like a swarm of angry bees! It's all you, ain't it, Foggy?! I'm tellin' ya, he's the source of all our unexplained troubles, and probably the Sheriff's too!",
      "Round 3 - Accused of": "you being seen after a recent train robbery with coal soot on your face.",
      "Round 3 - Rebuttal": "I wasn't tryin' to scare you, you old coot! I was just dirty from helpin' old Man Johnson with his furnace! He had a blockage, a real doozy, and I, bein' a helpful lawman, lent a hand!",
      "Round 4 - Accuses": "The Cactus Kid",
      "Round 4 - Accusation": "Alright, Cactus Kid, you want to be a tough outlaw, huh? Well, tough outlaws don't get sent to reform school! I heard the Sheriff was planning to pack you off to 'Mrs. Pennyfarthing's Home for Polite and Gentle Youths' because your 'unfit' uncle here was too crazy to be deemed a fitting guardian. Drop the act now, boy. Was he shipping you off?",
      "Round 4 - Accused of": "you having been in love with Belle, and jealous of Sherriff Chad when she dumped you for him.",
      "Round 4 - Rebuttal": "Jealousy?! Well, I suppose you'd know a thing or two about that, wouldn't you, Nurse? What's to be jealous of? Sheriff Chad kicked Belle out just like she did me, so she and I made friends again. She even gives me odd jobs here and there. \n\nSure, Mr. Tall-dark-and-handsome took my woman and my job. And sure, I blame him for driving me to drink and my life going all the hell. And sure, I sleep in a pig pen to keep warm... and that's on a good day. But [hiccup] I wanted to beat him fair and square. If I wanted him gone, I'd have done it fair and square in a duel, not some sneaky back-alley trick!",
      "Round 5 - Accuses": "Nurse",
      "Round 5 - Accusation": "Alright, Nurse Holliday, you act all innocent with your fancy medical words, but I've got informants that have been telling me about your 'new techniques.' They say you got this 'a-nuh-stee-zi-uh' stuff, and you can knock a person out cold with chloroform! Seems mighty convenient for a murder, doesn't it? Just a little sniff, and the Sheriff would have been out cold, easy pickings!",
      "Round 5 - Accused of": "you being questioned by Sherriff Chad.",
      "Round 5 - Rebuttal": "My Bluebell!'... that warn't no 'hauling in for questioning'! That was a man-to-man talk... professional mano-a-mano! \n\nThe Sheriff [hiccup] bless his soul, was consultin' with a true expert on frontier justice – yours truly! He was worried about those confounded train robbers, see? Wanted my insight on how a real lawman would track 'em down. We talked strategy, tactics, and maybe shared a nip or two. \n\nI got no 'secrets' to spill, least of all against you. It was just me givin' ol' blue-eyes the benefit of my vast experience.",
      "Round 6 - Final statement": "Alright, I'll spill it. The truth is... I was stealin' from Dusty's mine to buy whiskey...\n\nI was also the one who tipped off Sheriff Chad about Belle's train robbery gang. That's right, I was on the inside, workin' for Belle, but I figured her out. She was usin' me and I wanted that woman to suffer like she made me suffer. \n\nI met with the Sheriff right before he died, tellin' him everything about her operation, hopin' to cut a deal and save my own hide. He was gonna bust the whole gang! My focus was on gettin' Belle arrested and clearin' my name, not on stoppin' the Sheriff from doin' his job. I was too busy savin' my own skin to be involved in killin' him.",
      "Order of Final Statement": 5,
      "Why it isn't them": "Had turned on his gang and was working with the Sheriff."
    },
    {
      "Character": "Nurse Holliday",
      "Short Description": "Gambling Dentist",
      "Sex": "F",
      "isMurderer": false,
      "suggestedCostume": "Please provide suggested costume for Nurse Holliday",
      "suggestedProps": "Please provide suggested props for Nurse Holliday",
      "Round 1 - Introduction Script": "Well, now you're in for it! I'm Nurse Holliday, the only dentist in 100 miles! Don't let the 'Nurse' part fool ya, I ain't no softy; I draw teeth fast and I draw guns faster. Some folks call me 'Doc,' some call me 'Trouble,' but rest assured, whether it's a cavity or a desperado, I aim to extract the problem. So, who done it? Unlike the... faithful but... flawed Sheriff, I don't need no trial before I execute justice.",
      "Secret information": "You and Sheriff Chad had been secretly courting for months, and you truly believed he was going to propose. Your heart was set on a future with the town's lawman. However, everything changed when Gigi LaFlamme arrived in Sheriffkill Springs. The Sheriff became completely infatuated with Gigi, neglecting you and making you fear for the worst.  You believe that Gigi 'stole' your future.",
      "Round 2 - Story": "My evening? Well, after tending to a rather nasty abscessed tooth – make sure you are flossing regularly everyone! – My patient's screams of pain were still ringing in my ears, so I decided to take a little stroll. I just happened by the saloon. There was a lightining flash or something and I think I may have heard a loud whinney and a thud from the direction of the corral, but it is hard to say, those screams may have permanently damaged my hearing.",
      "Round 3 - Accuses": "Belle",
      "Round 3 - Accusation": "Belle, are you going to bring up the fact that you and Sheriff Chad had a history? You broke everything off from Wyatt Burp when our pretty boy came to town, and then he tossed you aside for someone with more... skillful and professional hands. I'm sure that had to gnaw at you like a canker sore...",
      "Round 3 - Accused of": "you peeping into all the windows of the Cloak & Daggar.",
      "Round 3 - Rebuttal": "My 'peeping' was purely for a medical assessment of the establishment's ventilation system, which, I might add, is abominable. And if I happened to glance inside, it was merely to ensure no one was over-indulging in the local spirits. As the town's only medical professional, it's my duty to monitor the health habits of its citizens... and not to STEAL OTHER WOMEN'S FIANCÉS like some HARLOTS in this town!",
      "Round 4 - Accuses": "Wyatt Burp",
      "Round 4 - Accusation": "Are we ever gonna talk about one of the most obvious suspects? The one who's always halfway through a bottle? Wyatt, everyone knows you were in love with Miss Bottoms! And then Sheriff Chad came along and stole her from you! You were always lookin' at him with daggers in your eyes! Were you so jealous that you just had to get rid of the guy who took your gal?",
      "Round 4 - Accused of": "you being engaged to Sherrif Chad before he dumped he became interested in Gigi.",
      "Round 4 - Rebuttal": "You've certainly lost my vote, Mayor! Chadwick and I are... were... engaged to be married. I'm sure he loved me, I'm sure of it! But then the train robberies start happening and this... vixen comes into town and he gets distant. He's following her around like hound. I had my suspicions so I followed Chad to the saloon to watch him and make sure he wasn't steppin' out with that hussy. \n\nMr. Mayor... Gigi... I got two middle fingers: one for both of ya'!",
      "Round 5 - Accuses": "Mayor",
      "Round 5 - Accusation": "Mr. Trails, you claim to be a certified crank with nothing but wild and imaginary grievances and persecutions. And yet, yesterday I saw you arguing with Sheriff Chad in a very loud, but, in my medical opinion, non-insane way. You were yelling and yet making your case without once mentioning trolls or elves. \n\nYou were sayin' something like, 'You ain't got no right to take the only thing I got worth livin' for!' What precisely was the Sheriff attempting to take from you and did you kill him to prevent it?",
      "Round 5 - Accused of": "you knowing how to knock a person out with chloroform.",
      "Round 5 - Rebuttal": "Wyatt, you nincompoop! I've taken an oath, and my medical skills are for healing, not for harming! My sharpshootin' skills are another matter...\n\nAnesthesia is a marvel of modern science, used to alleviate suffering, not inflict it! That is, if my patients pay extra! And yes, I am adept, thank you for noticing. But a skilled hand with chloroform is hardly a motive for murder. Perhaps you should worry less about my medical practices and more about your own... hiccups.",
      "Round 6 - Final statement": "I too, was stealing from Dusty's mine. I needed silver to make my tooth fillings!\n\nMy 'peeping' at the saloon, my 'stalking' of the Sheriff... it wasn't about murder. It was worry. I was worried Chadwick was gonna break off our engagement like he done to Belle! I was trying to catch him in the act and shoot him through the heart if he so much as dared touch that French flousey! \n\nBut he wasn't there and she was up on the stage. I was gonna have it out with him but I never got the chance. Now I know - he wasn't steppin' out on me - his love for me had driven him to a life of crime! How romantic! \n\nGigi, can you ever forgive me for all those times I called you a 'cheap two-penny hussy' behind your back?",
      "Order of Final Statement": 7,
      "Why it isn't them": "Never found the Sheriff to confront him. Would have shot him."
    },
    {
      "Character": "Dusty Trails",
      "Short Description": "Grizzled Old Prospector",
      "Sex": "M",
      "isMurderer": false,
      "suggestedCostume": "Please provide suggested costume for Dusty Trails",
      "suggestedProps": "Please provide suggested props for Dusty Trails",
      "Round 1 - Introduction Script": "Well, ain't this a fine how-dee-do! I thought Sheriff Chad were already dead and a walkin' around zombie. Did anyone check to make sure he ain't popped up again? I'm Dusty Trails, and I'm just an unlucky prospector who definitely ain't found no giant silver strike just outside 'a town! I ain't found nothin' ya' hear!!! There's been strange things happening in this town: cactuses walkin' around like people, horse-sized raccoon monsters, Gigi is a lizard-person... and I reckon one of them finally got tired of the Sheriff's snooping! All of y'all is always sticking your noses where they don't belong, always eyeing what's rightfully MINE. Who said anything about a secret mine?! Not me! \n\nMy horse went missing last week, and came back all fancified. Could'a been Gremlins... could'a been one of you... Just keep your hands off my claim, and maybe we won't have more folks ending up like the Sheriff.",
      "Secret information": "Despite your claims to the contrary, you have indeed struck a very large vein of silver in your mine just outside of town. Now, your paranoia is all-consuming. Theives are everywhere. Mysterious and mystical creatures are about, you've seen them!",
      "Round 2 - Story": "I was out mindin' my own business, like always. Diggin'. Always diggin'. Never findin' nothin', mind you... Nothin' ya' hear?!! And last night, I saw 'em again! The lights! Bright as polished silver! Hoverin', then shootin over the town and over the corral. Them varmints from outer space, always spyin', always tryin' to get at my silver! You think I'm crazy? Maybe you're the crazy ones for not seein' all the suspicious things a' goin' on here in Sheriffkill Springs!",
      "Round 3 - Accuses": "Wyatt",
      "Round 3 - Accusation": "I know all of you is lookin' to steal from my claim. Which ain't got nothin' in it, anyhow!... I know you're up to no good. Especially you, Deputy – or should I say – Racoon-Monster Burp! Right after that big train robbery, you came skulkin' by my claim with your face all painted up with soot like the Racoon Monster to scare me away!",
      "Round 3 - Accused of": "you threatening the townsfolk and disappearing into the bushes between two boulders just outside of town.",
      "Round 3 - Rebuttal": "I ran on that slogan because it was the TRUTH! The Sheriff was stealing my silver, in cahoots with all of you! Always trying to take what's mine, just like you politicians! \n\nAs fer' 'terrorizing law-abiding citizens'? I'm just warnin' people about what's really going on in Sheriffkill Springs! Maybe if you spent less time remodeling your office with fancy funiture and more time takin' my observations seriously, we'd have them alien train robbers in irons by now!\n\nAnd them bushes'? There ain't nuthin' over there. Nothin'! I was just answering the call of nature. Don't go back there! It's stinky!",
      "Round 4 - Accuses": "Mayor Augustus Maywho",
      "Round 4 - Accusation": "Mayor Butterfield, I find it very odd that I never see you and the Racoon Monster in the same room at the same time! A coincidence?! I also think it is quite the coincidence that you were seen entering the saloon just before the murder, and are mysteriously missing during the time of Sheriff Chad's death! What sort of 'Chamber of Commerce meeting' happens in the middle of the night and then a murder occurs just outside? Admit it! You are part of the illuminati, and the Sheriff had stumbled onto your secret ritual!",
      "Round 4 - Accused of": "you having a shiny new belt silver buckle.",
      "Round 4 - Rebuttal": "That's a lie! This buckle ain't from no train robbery! This here's pure, unadulterated silver, straight from my mine... I mean, miiiine own grandfather's last will and testament! And it's to ward off the werewolves, you see, not some useless accessory from some train.",
      "Round 5 - Accuses": "Phineas",
      "Round 5 - Accusation": "Phineas, you are always speakin' in mumbo jumbo that's probably witchcraft if you ask me! I heard you had a big fight with the Sheriff just before he died, because he confiscated your 'flux capacitor,' calling it a 'danger to the community!' What in the blazes is a 'flux capacitor,' would you kill him to get it back?!",
      "Round 5 - Accused of": "you arguing with Sherriff Chad.",
      "Round 5 - Rebuttal": "Just like all of you is tryin' to take my precious silver, the Sheriff was trying to take my precious nephew, the Cactus Kid, away to some fancy school for polite and gentle boys! I was defending my family, not planning a murder! He was a good boy, and the Sheriff was just being a meddling busybody, tellin' tall tales about my fitness to educate my nephew what with my 'delusional hallucinations', my 'instability', and my 'advanced persecution complex'! You city slickers wouldn't understand family loyalty!",
      "Round 6 - Final statement": "I know it sounds crazy... but I love my nephew.\n\nThe Sheriff was threatenin' to send him away, and that woulda' just broke this ol' prospector's heart. Cactus is a good kid. I knowed it was him who stole my horse, but he brought her back better'n and shinier than ever.\n\nThe Sheriff and me was makin' a deal. He told me I needed to 'tone down on the alien stuff' and that 'there weren't no such thing as extremely handsome human mimics who place themselves in positions of authority to observe and collect data on the human race, using their good looks to make the population instinctively trust them.'\n\nI agreed that that sounded pretty far fetched.",
      "Order of Final Statement": 1,
      "Why it isn't them": "Thought he had made a deal with the Sheriff to keep Cactus Kid home with him."
    },
    {
      "Character": "Gigi LaFlamme",
      "Short Description": "Singer and Can-Can Dancer",
      "Sex": "F",
      "isMurderer": false,
      "suggestedCostume": "Please provide suggested costume for Gigi LaFlamme",
      "suggestedProps": "Please provide suggested props for Gigi LaFlamme",
      "Round 1 - Introduction Script": "Mon chers! What a dreadful tragedy. Sheriff Chad...  so beautiful, so manly... a brute, yes, but he had a certain... rugged charm, non? Perhaps we ladies could 'compare the notes', yes? over glasses of the cabernet. \n\nI am Gigi LaFlamme, and it is my pleasure – and my business – to be the most desirable distraction in the entire territory. How did a hothouse rose such as myself find herself in the desert, so far from the sweet vineyards of my homeland? Ah, ah, ah!... a mademoiselle must have her secrets. Where Gigi goes, excitement follows, non? And sometimes, a little mystery keeps the gentlement interested.",
      "Secret information": "You are actually a French spy, operating under the guise of a flamboyant saloon singer. Your past is far more dangerous and notorious than anyone in Sheriffkill Springs suspects. The Sheriff had been asking too many questions that would have revealed your secret and put you in mortal danger.",
      "Round 2 - Story": "I am very disturbed by all of this. That one of you is a murderer! I am just a scared little mademoiselle and in need of protecting. Sheriff Chad was so very protective... of... all of us. He and I had a... private tête-à-tête just outside of the Saloon, just before he... [sniffs] pardonez moi... it is just too sad. I was onstage during ze terrible murder and I have dozens of adoring witnesses who can attest to zat.",
      "Round 3 - Accuses": "Nurse",
      "Round 3 - Accusation": "Nurse Holliday, you say you were just taking a 'stroll' by ze saloon. But I saw you, lurking like a coyote, peeping in all ze windows, including my dressing room! Why were you so desperate to spy on ze Cloak & Dagger, and on little old moi, hmm?",
      "Round 3 - Accused of": "you being in a history book as a famous French spy and murderer!",
      "Round 3 - Rebuttal": "Mon Dieu, Monsieur Fogg! You are being a, how-you-say, mad scientist? How can I be hanged in a history book when I am still alive and we are living in ze moment, non? You are very silly. I am very French, yes, but a spy?! I am an artist, not an assassin! Any 'resemblance' is purely coincidental, a trick of the light, perhaps. Or perhaps... I simply have a face that is unforgettable. My only 'secret' is how I maintain such beauty in this dreadful desert heat!",
      "Round 4 - Accuses": "Dusty Trails",
      "Round 4 - Accusation": "Mr. Trails, I have an eye for ze jewelry, and I notice you have quite and extremely large, shiny silver buckle on your belt. If, as you claim, you have not found any of ze silver in your mine, where you have gotten such an expensive accessory? I seem to recall that ze very thing that was reported to have been stolen during ze most recent train robberies it was silver, non?",
      "Round 4 - Accused of": "you throwing a beer in the Sherriff's face.",
      "Round 4 - Rebuttal": "Mon chers! A mere splash of beer? That was a moment of artistic expression, a fiery passion, not violence! I told him he needed to cool off, because of the vicious lies he was telling against me. I am used to having to douse the flames of an overzealous fan's passion. They sometimes get ze wrong idea! Ze Sheriff, he had a very wrong idea.",
      "Round 5 - Accuses": "Belle",
      "Round 5 - Accusation": "Belle, you think I am not paying ze attention when I am practicing and performing my shows. I am seeing many things. And some of zeze things I am seeing are men in masks coming in ze dark of night after each train robbery to ze back of ze Cloak & Daggar. I think you are knowing who are the 'Train Bang Gangers!'",
      "Round 5 - Accused of": "you missing a silver ring.",
      "Round 5 - Rebuttal": "How precious! My petite little beau! It is, how you say, \"puppy love\"? You have found my ring? It is a fake, nothing to speak of. \n\nHow ze Sheriff is getting it, I do not know, but he was always one for spotting ze smallest out place thing and following it - and following it - and never stopping until he is finding ze thing he is looking for even though it is very, very hidden. \n\nI must have dropped it and he is having ze eye of ze hawk, that fixes you from a mile away and doesn't let you escape, no matter how many miles from your home country you run... \n\nAnd he is finding it to give it back! Poor, attractive, Monsiuer le Sheriff. ",
      "Round 6 - Final statement": "Mon chers, I have a confession. I was stealing ze silver from Mr. Dusty. I need to look my best on ze stage! \n\nOn ze subject of ze murder, I am innocent. Sheriff Chad was not in love with me. He was in love with Nurse. So in love that he betrayed his own morals to blackmail me to get ze money he needed to propose to her. He had discovered a secret about me. Yes, Monsier Fogg, I was a spy. How your are knowing this, it is a puzzle to me. Sheriff Chad says that he wanted from me a ring to give his Nurse Holliday, or he was going to expose me, to turn me in! \n\nIt thought I was safe when I had bought his silence, but now his death means my cover is, how you say, exploded? I am a spy, yes, but not a murderer.",
      "Order of Final Statement": 2,
      "Why it isn't them": "Was onstage singing all night."
    },
    {
      "Character": "Phineas Phileas Fogg Jr.",
      "Short Description": "Steampunk Inventor",
      "Sex": "Any",
      "isMurderer": false,
      "suggestedCostume": "Please provide suggested costume for Phineas Phileas Fogg Jr.",
      "suggestedProps": "Please provide suggested props for Phineas Phileas Fogg Jr.",
      "Round 1 - Introduction Script": "Great Scott! A murder! This was not in my research... \n\nAhem! I am Phineas Phileas Fogg Jr., at your service! If I come across as eccentric and having an accent foreign to your frontier ears, it is because I have just arrived from the territory of Hawaii. \n\nI am a pioneer of applied sciences, a visionary of the steam-powered future! Though, I must confess, plutonium would be more efficient.",
      "Secret information": "You are, in fact, a scientist from 1985 stranded in the Old West after a temporal displacement incident involving your Pontiac Trans Am time machine. While attempting to fine-tune your chronological synchronizer in 1885, an unfortunately timed cattle stampede crushed your precious Trans Am. \n\nYou've adopted the alias 'Phineas Phileas Fogg Jr.' and immersed yourself in steampunk inventions to blend in, all while desperately seeking a way to rebuild your time machine and generate the 1.21 gigawatts needed to return to your own time. The Sheriff had been suspicious of you from the start, and even now, you know that any interference with the past could have dire consequences for the future.\n\nTo fund your experiments, you have been stealing from Dusty's \"secret\" mine.",
      "Round 2 - Story": "I was in my laboratory, just beyond the edge of town – it is a bit ramshackle, I'll admit, but perfect for minimizing chronometric feedback loops. I was attempting to recalibrate the controls on my misbehaving temporal displacement units, I was quite immersed in my calculations. I had recently had quite a setback in my project and needed to start all over again from scratch.",
      "Round 3 - Accuses": "Gigi",
      "Round 3 - Accusation": "Mademoiselle LaFlamme, you present yourself as an innocent and helpless entertainer, but my research into this area's history prior to arriving was extensive. I distinctly remember reading in a history book of a woman who bears your resemblance that was hanged as a notorious French spy and murderer! How do you account for that?",
      "Round 3 - Accused of": "your laboratory being the source of mysterious floating lights.",
      "Round 3 - Rebuttal": "Dusty, my friend, those 'mysterious floating lights' are merely the natural byproduct of cutting-edge temporal mechanics! They are a visual manifestation of quantum entanglement, perfectly harmless unless, of course, someone were to introduce an unstable chroniton particle into the sub-aetheric field...\n\nThat, I assure you, I have no intention of ever doing again!! ",
      "Round 4 - Accuses": "Gigi LaFlamme",
      "Round 4 - Accusation": "Gigi, I am interested in physical and in chemical interactions. Last week, when I was obtaining a sample of brewers yeast for one of my experiments, I sat at the piano and played a little ditty I know, \"Careless Whisper\" (I think it will be a big hit someday). From my unassuming perch as the unobtrusive piano player, I observed a most interesting physical interaction between you and the Sheriff. You threw a full glass of beer right in his face! Perhaps something explosive was brewing between you two?",
      "Round 4 - Accused of": "you working on a strange \"metal carriage.\"",
      "Round 4 - Rebuttal": "Miss Bottoms, that 'metal carriage' is a marvel of temporal engineering, and is equiped with all required safety belts! It is a prototype for an expedited continental transit, if only there were pavement it could drive upon! The 'flames' are merely an aesthetic embellishment, a touch of artistic flair... in other words, they make it look awesome.  Madame, when my aparatus is fully functional, I will take you on a ride myself to show you how safe it is!",
      "Round 5 - Accuses": "Mayor",
      "Round 5 - Accusation": "Mayor Butterfield, I understand you take your duties very seriously and what wants best for the town. I imagine the Sheriff getting to the bottom of the train robberies would have been the best thing for the town and yet I heard you asked Sheriff Chad to go on vacation for a few months to, and I believe I am accurate in quoting you: 'relax and unwind from the stress of trying to find those dastardly, yet clever and probably handsome train robbers.' \n\nWas this a vacation offer, Mayor, or a convenient way to get the Sheriff out of the way before his 'stress' uncovered something you didn't want him to find?",
      "Round 5 - Accused of": "you arguing with the Sheriff after he confiscated your flux capacitor.",
      "Round 5 - Rebuttal": "The 'flux capacitor' is a crucial component for temporal displacement, a device far beyond your current comprehension! Its confiscation by the Sheriff was a grave misunderstanding, a setback for my scientific endeavors, not a motive for murder! \n\nIt was merely a misunderstanding, a bureaucratic snafu! I assure you, my scientific pursuits are geared towards humanity's advancement, and I am 98.7% sure that I can avoid destroying the galaxy in a paradoxical doom loop!",
      "Round 6 - Final statement": "This charade has gone on long enough. I am not from the Hawaii Territory, as I have claimed, but from the year 1985! I am a temporal physicist, and I became stranded here in 1885 during a disastrous time-travel experiment. \n\nMy confiscated 'flux capacitor' was vital to my return! I'd been stealing the conductive silver from Dusty's mine to recreate my circuitboards and was almost finished! The Sheriff forced me to start over from scratch. I was in my laboratory all night, attempting to kick start my a binary temporal anomaly and two of them escaped from my lab and flew out into the night. \n\nI'm trying to get back to my own time, not alter the course of history! At lease, not again!",
      "Order of Final Statement": 3,
      "Why it isn't them": "Doesn't want to mess up the time continuum."
    },
    {
      "Character": "Mayor Augustus Maywho",
      "Short Description": "Town Mayor",
      "Sex": "M",
      "isMurderer": false,
      "suggestedCostume": "Please provide suggested costume for Mayor Augustus Maywho",
      "suggestedProps": "Please provide suggested props for Mayor Augustus Maywho",
      "Round 1 - Introduction Script": "I am Mayor Bartholomew Butterfield, and I decree today a day of mourning for our beloved town of Sheriffkill Springs - It occurs to me that we should look into changing our town's unfortunate name... \n\nI assure you, we will get to the bottom of this heinous crime. Sheriff Chad, the square-jawed man of considerable manliness. The hunky pillar of our community, is a great loss indeed. Rest assured, justice will be served and I will personally ensure that our next sheriff is just as capable and attractive as our beloved Sheriff Chad.",
      "Secret information": "You are secretly the financial backer and silent partner for Belle Bottoms' notorious train robbery gang. You provide the funds, the intelligence, and the political cover for their operations, receiving a hefty cut of every heist. Sheriff Chad, however, was getting dangerously close to uncovering your involvement. He had begun to be suspicious about your lavish lifestyle on a small-town mayor's salary.\n\nYou were also stealing from Dusty's \"secret\" mine.",
      "Round 2 - Story": "My alibi, you ask? Perfectly solid, perfectly transparent. I was, as any dedicated public servant would be, engrossed in critical town matters. Specifically, I was in a Chamber of Commerce meeting at the Cloak & Dagger Saloon's private back room. It concerned the future infrastructure development of Sheriffkill Springs. If there was a disturbance outside, I didn't hear it. I was focused on representing the interests of the citizens of our fine town. Vote for me.",
      "Round 3 - Accuses": "Dusty",
      "Round 3 - Accusation": "Mr. Trails, it pains me to be the one who discusses the elephant in the room, but it seems to me that the likeliest suspect is the one who ran against me in the last election with the platform slogan of, \"The Sheriff is Stealing my Silver\". You are always terrorizing all these good, law-abiding citizens with cockamamie, crackpot stories. Not to mention that you have been seen slinking off into the bushes between those very obviously mine-shaped boulders at the edge of town. Very suspicious if you ask me.",
      "Round 3 - Accused of": "you buying up land in nearby Eastwood Canyon.",
      "Round 3 - Rebuttal": "My acquisitions in Eastwood Canyon is purely for the future prosperity of Sheriffkill Springs! It is a strategic location for potential urban expansion, a civic duty to secure land for our burgeoning population. Unlike some here, I think of the long-term future of this town, not merely the bottom of a whiskey bottle.",
      "Round 4 - Accuses": "Nurse Holliday",
      "Round 4 - Accusation": "Nurse, let us quit this farce that you were checking in on the saloon's ventilation. Everyone in this town knows about you and the Sheriff! He was gonna propose, wasn't he? But then what was going on between him and Gigi? A mayor's ears are like a spitoon, collecting things here and there from all over...\n\nA woman scorned, and a sharpshooting sawbones, no less? Seems to me, your heartbreak might have driven you to 'extract' the Sheriff permanently!",
      "Round 4 - Accused of": "you being seen entering the saloon, but missing during the time of the murder.",
      "Round 4 - Rebuttal": "Tsk, tsk, tsk. I'm afraid it's gotten worse. Sheriff Chad was quite right that you are no fit guardian for a minor. \n\nI'll have you know that my 'absence' was merely a brief respite to... attend to certain mayoral duties that require... discretion. The Chamber of Commerce meeting was indeed quite productive and I think will result in a blossoming economy for our beloved Sheriffkill Springs. If only our strapping, Adonis-like Sheriff could see it that way... Ah, a mayor's work is never truly done, even late into the evening. \n\nPerhaps you should focus on raising your little 'outlaw', and I'll manage the affairs of Sheriffkill Springs, both public and... confidential.",
      "Round 5 - Accuses": "Cactus",
      "Round 5 - Accusation": "Cactus Kid, we need your help in this matter. I know you claim to be a tough outlaw, but I have it on governmental authority that just before the Sheriff's unfortunate demise, you were seen in the corral. \n\nThat's right, my boy, I saw you myself... crying. What or who did you see after that moment and who did this terrible deed?",
      "Round 5 - Accused of": "you suggesting that Sheriff Chad go on vacation for a few months.",
      "Round 5 - Rebuttal": "My concern for Sheriff Chad's well-being was purely humanitarian! The man was under immense pressure, chasing those nefarious train robbers. A vacation was a benevolent suggestion, a chance for him to recuperate, to return refreshed and renewed! It was a thoughtful gesture, a testament to my civic leadership, not a nefarious plot to 'get him out of the way.' \n\nI know the strain of being a public servant and was merely prioritizing our hunky hometown hero's mental health!",
      "Round 6 - Final statement": "I too, was taking a bit here and there from Dusty's mine. I needed capital for my investments.\n\nMy dealings with Belle Bottoms, my suggestions that the Sheriff take a holiday (get it? take a Holliday?)... it was all about diverting the Sheriff. \n\nI am indeed the financier of Belle's train robberies. Sheriff Chad was following the money surrounding my land purchases and he was about to expose my entire operation. I needed him out of the way, yes, but not dead! I had arranged for him to go on a 'vacation,' to get him out of Sheriffkill Springs long enough for me to clear my tracks and bribe him into silence. \n\nHis murder is a disaster for me; it means a new, much less handsome, and likely incorruptible lawman will take over, and all my secrets will now be exposed. I needed him alive, just out of the way, not silenced permanently in this horrible fashion!",
      "Order of Final Statement": 6,
      "Why it isn't them": "Wanted to bribe the Sheriff instead. Killing the Sheriff just brings another one."
    }
  ]
}