{
  "metadata": {
    "scriptId": 1,
    "title": "Murder at the Fancy Opera House",
    "version": 1,
    "description": "The producer of 'La Mysteriosa' is found dead at the bottom of the grand staircase. Dueling prima donnas, royalty, artistic staff, a lowly usher, TikTok influencer, and even a 'Phantom' are all suspects.",
    "setting": "The Fancy Opera House",
    "timePeriod": "Modern Day",
    "difficulty": "Medium",
    "estimatedDuration": 90,
    "minPlayers": 8,
    "maxPlayers": 8,
    "targetAudience": "10+",
    "tags": ["opera", "theater", "romance", "blackmail", "ghost"],
    "author": "JJ",
    "createdDate": "6/28/2025",
    "lastModified": "6/28/2025",
    "victim": "Mortimer Curtainfall",
    "numberOfRounds": 6,
    "backgroundAsset": "../assets/images/backgrounds/opera_murder_mystery_v1background.png",
    "introduction": "Welcome, esteemed guests, to the Fancy Opera House and to the final dress rehearsal of 'La Mysteriosa'! Nerves and excitement were high, and the first act went beautifully. Intermission came, and yet the second act never began.\n\nMortimer Curtainfall, the esteemed, influential, and as it turns out, complicated Producer of 'La Mysteriosa', was found lifeless at the bottom of the grand staircase just before the second act was to begin.\n\nA bump on his head and small bit of blood, perhaps from the fall down the stairs, gives the only clue to the cause of death. Was it an accident? Or a heinous act committed by one among you?\n\nThe doors of the opera house have been sealed. The authorities are, no doubt, on their way, but for now, you, the illustrious cast, crew, and patrons of 'La Mysteriosa', are locked within these opulent walls. Each of you carries secrets, motives, and perhaps even the means to have brought about Mortimer Curtainfall's untimely demise.\n\nIt now falls to you to unravel this melodramatic mystery. Examine the evidence, scrutinize the alibis, and expose the hidden truths. Tonight, the greatest performance will not be on stage, but right here, among yourselves, as you determine:\n\nWho killed Mortimer Curtainfall?"
  },
  "characters": [
    {
        "characterId": "character-1",
        "Character":"Ivana Killioux",
        "Short Description":"Prima Donna",
        "Sex":"F",
        "isMurderer": false,
        "suggestedAge": "Any",
        "costumeNotes": "none",
        "accent": "none",
        "suggestedCostume": "none",
        "suggestedProps": "conductor's baton",
        "Invite Description":"You are Ivana Killioux, Prima Donna of the opera house with a temperamental larynx and a fiery temper. You can dress in a ballgown (\"I always want to look my best. It's what's expected of a star.\") or as a maid (the character you were rehearsing when the murder was discovered.)",
        "Character Details":"The stage is your domain, and this production was to be the pinnacle of your meteoric rise. However, the backstage whispers of another soprano threatening your reign, have left you feeling anything but triumphant. You are a force of nature, a diva of the highest order, and you will not be easily replaced.",
        "Motive":"Heard she was being replaced by Lady Sharp",
        "Means":"Access to poison",
        "Opportunity":"Could have poisoned Mort anytime during the day",
        "Red Herrings":"- \"Fire-y\" temper\n- Having an affair with Clef",
        "Round 1 - Introduction Script":"It's funny, really! Mr. Curtainfall stage diving down the grand staircase? And people say I'm dramatic.  I am Ivana Killioux, you understand, the Prima Donna, the very sun around which this entire operatic universe should revolve. I've had people try to upstage me before, but this is a little desperate.\n\nMy opening night, the culmination of my artistry, is now in jeopardy. People are making such a fuss, and talking as if we might postpone the opening?! But the show, darlings, my show, must always go on. \n\nIt's quite unprofessional, really. My nerves, honed for the exquisite precision of my performance, are now quite annoyed. Someone simply must clear this away. The world, after all, awaits my next entrance, and the real tragedy would be any disappoint my fans.",
        "Secret information":"While your public persona is all about operatic triumph, your private life has its own complex counterpoint. You and Conductor Clef Hanger have been secretly involved for months. This affair is the real reason you were cast in 'La Mysteriosa'. You spoke to Clef after you heard rumors about being replaced with another singer, and he was livid, promising to 'handle' Curtainfall.",
        "Round 2 - Story":"I was putting ice on my shoulder in the greenroom. I injured it by striking my diva pose [pose, painfully]. My body is my instrument, and I've gone and damaged it. I don't have any idea why anyone would want to murder Mr. Curtainfall. He was such a sweetheart, giving me my big break and all.",
        "Round 3 - Accuses":"Penny",
        "Round 3 - Accusation":"From the greenroom, I saw Penny Prattle leaving Mr. Curtainfall's office door shortly before the first act began. I thought she might have been stealing something, but what does he have in there except old photographs and playbills? What were you doing in there?",
        "Round 3 - Accused of":"you kissing Clef in the Green Room.",
        "Round 3 - Rebuttal":"So what about me and Clef?... I'm sure he would have cast me even without my performance on the couch. Isn't that right, pet?",
        "Round 4 - Accuses":"Lady B",
        "Round 4 - Accusation":"My instrument is extremely sensitive and is triggered by the slightest whiff of irritation. When we all came out to see the... trouble... That floral scent... it was so strong near Mr. Curtainfall's body. And you know who always reeks of lilies, don't you? Lady Beatrice! She was looking awfully pale and clutching that handkerchief. Perhaps her ladyship's delicate sensibilities couldn't handle the aftermath of her own actions!",
        "Round 4 - Accused of":"potentially losing your role to Lady Beatrice.",
        "Round 4 - Rebuttal":"Darling, I am a Prima Donna. My expressions are artistic, not 'rage.' I recall a rather spirited discussion with Mr. Curtainfall about his... unfortunate casting ideas. It's called 'passion,' dear, something you can't capture in a ten second TikTok.  If my voice carried, it's merely a testament to its power. Mr. Curtainfall was having a... momentary lapse in judgement... and the dollars that the Duke was dangling was clouding his mind. I was reminding him about the many, many reasons why he had made the right choice in me in the first place. ",
        "Round 5 - Accuses":"Ego",
        "Round 5 - Accusation":"As the obvious best choice for the role, I was never worried Mr. Curtainfall making the correct decision, but Ego did. I overheard Ego saying yesterday that if he didn't fire Pavlov and give him the role, he'd \"Tell the Duke everything.\"",
        "Round 5 - Accused of":"you potentially using poison to kill Mr. Curtainfall.",
        "Round 5 - Rebuttal":"A woman's weapon? You caveman! Just because you bought one Diva doesn't mean you can bully me!",
        "Round 6 - Final statement":"So I am assertive and tend to get what I want! Sure, my threats to Mr. Curtainfall were delivered with operatic flair, but they were merely words born of artistic enthusiasm. My passion is for the stage... oh and you, Clef... not for violence. Oh!!! I am a persecuted innocent!",
        "Order of Final Statement":3,
        "Why it isn't them":"Was never in real danger of losing her spot."
    },
    {
        "characterId": "character-2",
        "Character":"Ego Cadenza",
        "Short Description":"Understudy Tenor",
        "Sex":"M",
        "isMurderer": false,
        "suggestedAge": "Any",
        "costumeNotes": "none",
        "accent": "none",
        "suggestedCostume": "none",
        "suggestedProps": "usher's flashlight",
        "Invite Description":"Wears half a mask due to an unexplained facial deformity or scar.",
        "Character Details":"Your powerful voice and undeniable talent should have secured you the lead. Yet, Curtainfall, with his fickle promises, has consistently slighted you in preference for Pavlov Pavlovavich (who is currently having his wig surgically removed). You believed you had leverage, a secret that could finally put you in the spotlight, but now... the spotlight is getting a little hot.",
        "Motive":"Wanted the lead role",
        "Means":"Underground lair to surprise anyone",
        "Opportunity":"- Warming up in the subterranean basement of the Opera House (Phantom of the Opera)",
        "Red Herrings":"- Was blackmailing Curtainfall\n- Overheard threatening to \"Tell the Duke everything.\"\n- He practically \"lives\" at the opera house (is the Phantom of the opera)\n- Was disfigured 18 years ago in a freak opera accident",
        "Round 1 - Introduction Script":"A tragedy? A mystery? Such is life. I am Ego Cadenza. Am I just an understudy? Or am I the voice that is echoing in your soul?\n\nI wander these hallowed halls, you see. My art demands it. Every echo, every whisper, every stray vibrato, it all contributes to the grand symphony that is 'La Mysteriosa'. I find myself in the shadows, yes, listening, observing, absorbing the very essence of the performance. A true artist must be everywhere, feel everything, to understand the true resonance of the human condition.\n\nI was... preparing my instrument, allowing my voice to mingle with the very foundation of this magnificent structure. Then, a sudden, jarring silence. I felt a great disturbance in the Opera House, as if millions of dollars suddenly cried out in terror and were suddenly silenced.",
        "Secret information":"You've been living a hidden existence within the very walls of this opera house for years, finding refuge in its forgotten nooks and crannies. 18 years ago, a terrible stage accident scarred one half of your incredibly handsome face, ending your promising career as a leading man and forcing you to ever only be \"The Understudy of the Opera\". You've observed everything from the shadows, including dirt on Mortimer Curtainfall which you were using to blackmail him into promoting you from understudy to Primo Divo.",
        "Round 2 - Story":"I was warming up in a secluded spot with great resonance. I'm sure someone probably heard my pear-shaped tones. And then the fire alarm went off. I can break a crystal glass with my singing, but I'm pretty sure I can't set off a fire alarm... although I probably could with practice.",
        "Round 3 - Accuses":"Seymour",
        "Round 3 - Accusation":"From a... secluded spot, I saw Seymour slip a folded paper to Mr. Curtainfall... He was passing it so that others wouldn't see... but I did! No one sees me see what I see, when I look from where I am, which is everywhere.  I wonder what secrets it held. Seymour, what secrets did you share with our beloved Mr. Producer?\"",
        "Round 3 - Accused of":"skulking about, popping up in unexpected places and disappearing without a trace.",
        "Round 3 - Rebuttal":"I live here. Under the operahouse are very spacious catacombs, a subterranean lake, and a fully operational pipe organ. It beats paying rent.",
        "Round 4 - Accuses":"Penny Prattle, Opera Influencer",
        "Round 4 - Accusation":"Miss Prattle, I am not, how you say, 'stalking' you, but... your soul, it sings with such a profound agitato sometimes. Just before the curtain, I perceived a deep resonance, a tremor of… emotional distress, emanating from the Ladies' Powder Room near the main hall. Such a fragile, almost mournful aria. Were you perhaps overcome by the opera's tragic beauty?",
        "Round 4 - Accused of":"harboring resentment against Curtainfall for your disfigurement.",
        "Round 4 - Rebuttal":"Yes, this visage, this living tableau, bears the mark of that fateful night. A misstep, a misfortune, but perhaps also, a blessing? My solitude within these venerable walls is not a prison of vengeance, but a sanctuary of pure artistry! My soul has never been more in tune, and my voice never stronger. It is time to show my face again!",
        "Round 5 - Accuses":"Deirdre",
        "Round 5 - Accusation":"My disfigurement in a freak opera accident years ago was because of a director staging an unsafe stunt. And this one is no better! You know she is putting real poison in the prop bottle?! Perhaps the fall was not from a blow from Mr. The Duke's cane, but a swoon from poison!",
        "Round 5 - Accused of":"you blackmailing Mortimer.",
        "Round 5 - Rebuttal":"Just because my face was permanently disarranged in that freak opera accident 18 years ago, doesn't mean I can't play a handsome lead! My midnight lurkings have brought many whispers into my highly attuned ears. I usually keep the secrets of the night, but when I heard Seymour and Mortimer talking about 'cooking the books so that the Duke wouldn't ever find out', I knew I finally had my ticket out of the shadows and into... the light!",
        "Round 6 - Final statement":"I literally live and breathe opera all day, every day. Mortimer and his careless stage safety practices and business shadiness are irrelevant to what is truly important. The art. Deirdre, 'La Misteriosa' is a masterpiece. Brava! Ivana, you will be fantastic. Sing for me, my Angel of Music! My ambition may be strong, but my love for the opera is stronger. I am no murderer. I am innocent.",
        "Order of Final Statement":5,
        "Why it isn't them":"He needed Mortimer."
    },
    {
        "characterId": "character-3",
        "Character":"Deirdre Reed DeScript",
        "Short Description":"Director",
        "Sex":"F",
        "isMurderer": false,
        "suggestedAge": "Any",
        "costumeNotes": "none",
        "accent": "none",
        "suggestedCostume": "none",
        "suggestedProps": "conductor's baton",
        "Invite Description":null,
        "Character Details":"You are the visionary and artistic soul behind 'La Mysteriosa'. Curtainfall's constant interference and now his ludicrous notion of replacing your brilliant Prima Donna with a faded former singer have filled you with righteous fury. Your masterpiece was threatened, and you were prepared to fight like a momma bear for your \"baby\".",
        "Motive":"Protecting her show from bad casting",
        "Means":"Access to poison",
        "Opportunity":"Could have poisoned Mort's champaign",
        "Red Herrings":"- Has \"stage\" blood on cuff of shirt\n- Insisted on having \"real\" poison as a prop (to give \"verismo\")",
        "Round 1 - Introduction Script":"No! No, no, no! This is not how things were to go! I am Deirdre Reed DeScript, the Director, the architect of 'La Mysteriosa', and I tell you, this was not how the story is supposed to go!\n\nMy creative vision, my meticulous blocking, the very soul of this production, has been irrevocably shattered by this crude, unscheduled improvisation. Someone has added a unnecessary side plot. Now the only thing that will be said about this production will be the murder. Tell me, what was the name of the play Abraham Lincoln was watching? Exactly!!!",
        "Secret information":"Your dedication to art sometimes requires... unconventional methods. Days ago, you made a copy of Mortimer Curtainfall's private office key. You wanted easy, unnoticed access. You used this key just before intermission to sneak inside to search for any contracts or documents that might prove whether Mortimer was going to go through with replacing Ivana. You didn't find anything, but you noticed that it wasn't locked and it looked like the office had already been searched by someone less careful than you.",
        "Round 2 - Story":"Earlier that week, the Duke and Duchess had arrived and thrown everything off-balance. Rehearsals were going fine before then. Now the place almost burns down, our lead tenor, Pavlov Pavlovavich, used the wrong glue for his wig and is having it surgically removed. Mort was worse than useless. He was saying \"Pavlov will be back tomorrow, what's the big deal?\" and he was encouraging the Duke's meddling. He told me that it was \"imperative that the Duke's money kept flowing and that my salary depended upon it,\" so I better \"get in line.\"",
        "Round 3 - Accuses":"Vanna",
        "Round 3 - Accusation":"So much bad acting in this room! Speaking of acts I wish I never saw, you'll never believe what I saw Ivana and Clef doing on the couch in the greenroom!",
        "Round 3 - Accused of":"you covering up blood stain on your shirt cuff.",
        "Round 3 - Rebuttal":"It is blood, but it's not Mr. Curtainfells. At least, I don't think! Last week, I told him to get me stage blood but that I wanted it to be actual blood to give it that, \"Oh-my-gosh-is-that-real-blood!!!\" effect onstage. It has to be refrigerated so I was taking it out to get it prepped for the second act when I was distracted and spilled it..",
        "Round 4 - Accuses":"Duke Reginald von Flatt",
        "Round 4 - Accusation":"Your Grace, with all due respect to your exalted station, one cannot help but point out the rather… grisly rumors that seem to follow your distinguished lineage. There are reports of individuals who have dared to cross your family finding themselves having accidents.  And here we have poor Mortimer having an accident? Your Grace's cane could make quite the weapon.",
        "Round 4 - Accused of":"sneaking into Curtainfall's office",
        "Round 4 - Rebuttal":"Maestro, I'm simply amazed that you had time to do anything with your eyes than oogle our leading lady. Yes, I was in Mort's office. I go in there a lot... I had props make me a copy of his key. My artistic integrity demands that I monitor every risk to my production, including the producer! I was searching for Lady Beatrice's contract. I wanted to destroy it before she could destroy my vision! But I didn't find it. I found everyone's contracts, but not one for the Duchess. I went back the second time because I remembered I hadn't locked it back up, and in between it seemed like Mort had thrown a temper tantrum, papers and letters were everywhere. My actions were purely in service of 'La Mysteriosa,' unlike some who conduct themselves without scruples or shame!",
        "Round 5 - Accuses":"Penny",
        "Round 5 - Accusation":"Mort certainly wasn't acting when he was arguing with that you, Prattle, in the lobby during the intermission. He snatched a paper from you saying \"I don't care whose daughter you think you are!\" I thought he meant that you were some spoiled rich person's kid who didn't need a real job... but maybe it was something else.",
        "Round 5 - Accused of":"you ordering the prop bottles to be filled with poison.",
        "Round 5 - Rebuttal":"Yes, I was the one who filled the poison prop with poison. No one is scripted to drink it and it's labeled \"poison\"! But... knowing that the poison is real! And deadly! That makes your actors treat it with proper respect. Both Irina and Ego knew the poison was real. That was the point.",
        "Round 6 - Final statement":"While I may sometimes go to extremes to ensure that my shows slay theatrical conventions, and that I murder preconceived notions, I am not a killer. Mort put up with my crazy and I put up with his imbecility. We were a great pair! I am a director of drama, not a perpetrator of it. I am innocent.",
        "Order of Final Statement":2,
        "Why it isn't them":"Blood was fake. Poison was real, but Mort didn't show any sign of poisoning in his actions."
    },
    {
        "characterId": "character-4",
        "Character":"Reginald von Flatt",
        "Short Description":"Duke",
        "Sex":"M",
        "isMurderer": false,
        "suggestedAge": "Any",
        "costumeNotes": "none",
        "accent": "none",
        "suggestedCostume": "none",
        "suggestedProps": "bejeweled cane",
        "Invite Description":null,
        "Character Details":"Your Grace! A patron of the arts and a man of considerable influence, you get what you want, including your current wife, whom you plucked from the stage 18 years ago. However, whispers of mismanagement and your growing suspicion regarding Curtainfall's interactions with your wife have cast a dark shadow over the evening. Your honor, and your investments, are paramount.",
        "Motive":"Was being stolen from\nWanted wife as star\nJealous\/Suspicious",
        "Means":"Big bejeweled cane",
        "Opportunity":"Was in bathroom for a long time",
        "Red Herrings":"- Was being stolen from\n- Jealous man. Fearful of wife being stolen.\n- Pressuring to have Vanna replaced",
        "Round 1 - Introduction Script":"I am Duke Reginald Von Flatt, a man of considerable standing, and frankly, I find this entire affair quite... unseemly. One attends the opera for culture, for enlightenment, perhaps for a subtle nod to one's investments in the arts, not for such ghoulish spectacle!\n\nMy evening, you understand, was meticulously planned. A brief, vital conversation with the Producer, then to my box to witness my investment's second act. To discover the Producer, Mortimer Curtainfall, in such a state, at the foot of the grand staircase, no less, is a profound inconvenience. It reflects rather poorly on the establishment. One simply doesn't expire in such a public, untidy fashion. This isn't *Broadway*. Rest assured, I shall personally ensure this… unfortunate incident… is resolved with the utmost efficiency and, dare I say, discretion. My time, like my patience, is quite limited.",
        "Secret information":"Your family's history, steeped in power and influence, also carries whispers of a darker side. Rumors persist that over the generations, troublesome individuals who have crossed your family have met unfortunate ends, often involving suspicious \"accidents\" like falls from great heights or the inexplicable ingestion of rare, untraceable poisons. You've always dismissed these as mere gossip, but the reputation precedes you, and you're acutely aware of the power your position holds.",
        "Round 2 - Story":"I saw that the house was a bit shabbier than I remembered it. Where were the pilfered cultural artifacts from conquered colonial countries? Where was the ostentatious gold leaf in the lavatory? It seemed that perhaps its best days were behind it. When I mentioned this to Mort, he said our upcoming production was sure to bring in new audiences and recoup my investment easily, allowing me to continue my patronage, and him to buy a new carpet for the lobby.",
        "Round 3 - Accuses":"Deirdre",
        "Round 3 - Accusation":"Does anyone know where the champagne has gone? I had ordered a bottle for the second act but they only brought the chiller. This ordeal is leaving me quite parched.",
        "Round 3 - Accused of":"you cleaning your gloves.",
        "Round 3 - Rebuttal":"I heard the alarm backstage and I wanted to ensure my investment didn't go up in smoke. It was dark and untidy back there and I accidentally put my hand on something filthy. I believe it was something called a 'stage manager'. I care about my appearance and notice the appearances of others. That is why I note that Deirdre is covering up a blood stain on her shirt cuff!",
        "Round 4 - Accuses":"Seymour",
        "Round 4 - Accusation":"Mr. Seats, I make it my business to know everything about my investments and my Private Investigator found that you haven't always had the last name of \"Seats\" now have you? \n\nYou used to go by another family name... one that rings with a certain, shall we say, criminal undertones? What had you gotten Mortimer mixed up in?",
        "Round 4 - Accused of":"Von Flatt enemies finding themselves dead.",
        "Round 4 - Rebuttal":"Slander and lies! I am a Duke. It is true that in my country, sometimes people I am odds with find themselves falling out of windows, or drinking polonium tea... but I am a public figure and I know a LOT of people. It is a simple law of mathematics that some of them will die suspiciously and dramatically.",
        "Round 5 - Accuses":"Ivina",
        "Round 5 - Accusation":"I was delighted that my wife would be returning to the stage. I imagine there were some to whom this would be quite disturbing news. Eh, Ivina? While a fall *appears* to be the cause of death, we aren't sure exactly what killed Mortimer. Poison is a woman's weapon, after all.",
        "Round 5 - Accused of":"you being jealous after seeing Mortimer embracing Lady Beatrice.",
        "Round 5 - Rebuttal":"He said that he was only congratulating her on taking over the role of \"La Virgina Youtha.\" But now I am starting to think that Mortimer may have been 'pulling my finger' (as the Americans say).",
        "Round 6 - Final statement":"It appears that Mortimer was stabbing me in the back at every turn, he was stealing from me and he was not going to give my Duchess her grand return. I, however, knew none of this. If I had, he would not have found himself at the bottom of a few stairs. Enemies of Von Flatt fall from much higher up!!! I am innocent of this.",
        "Order of Final Statement":4,
        "Why it isn't them":"Believed his wife was being cast. If he wasn't casting her, then he could be reassured that they probably weren't romantically inclined. Ego still hadn't revealed the fraud to him."
    },
    {
        "characterId": "character-5",
        "Character":"Lady Beatrice Sharp-Flatt",
        "Short Description":"Duchess",
        "Sex":"F",
        "isMurderer": false,
        "suggestedAge": "Any",
        "costumeNotes": "none",
        "accent": "none",
        "suggestedCostume": "none",
        "suggestedProps": "perfume bottle",
        "Invite Description":null,
        "Character Details":"Once a celebrated soprano, you traded the stage for a life of nobility. The Duke is pushing to oust Ivana and set the stage for your triumphant return. Your past with Curtainfall is complicated and the thought of your past indiscretions being discovered fills you with dread.",
        "Motive":"Wanted to conceal her lovechild - gave child up for adoption prior to marrying duke 20 years ago",
        "Means":"Could have surprised Mort by pretending to be friendly",
        "Opportunity":"Husband was in the bathroom for a long time",
        "Red Herrings":"- Scent detected on Barry's body\n- Call's Mortimer \"Morty\" - was former lover\n- Was being passed over for Vanna. She did not want the role, Reginald (Reggie) was being sweet.",
        "Round 1 - Introduction Script":"As you all know, I am Duchess Beatrice Sharp-Von Flatt. I, of course, retired from the stage almost two decades ago for matters of, shall we say, higher importance. One marries a Duke, and one's priorities, naturally, shift.\nDucky knew that I sometimes missed it and he brought me here to celebrate my glory days and live vicariously through the singers as co-executive producer. After all, what's Ducky's is half mine! I can't believe Morty is dead. It had been so long since I had last seen him, and now he's gone forever.",
        "Secret information":"Your marriage to the Duke was a calculated escape from a scandalous past. 18 years ago, you secretly gave birth to Mortimer Curtainfall's child – your daughter, Penny Prattle. He arranged for her immediate, secret adoption to avoid ruining your impending marriage to the Duke. Mortimer was the only one who truly knew the full truth, and just before he died, he had brought it up, saying that something had changed and that you two, \"Needed to talk.\"",
        "Round 2 - Story":"It felt good to be back in the theater again, but it feels strange sitting in a box now instead of being on stage. I suppose old habits die hard, but the nice thing is that my stage jewelry are now real diamonds.\n\nOf course, I've still got the pipes that earned me the sobriquet 'The Velvet Foghorn'... [sings: Aaaaa-oooooo-ga!]\n\nAnd, as you can hear, like a fine wine, perhaps my voice has grown even better with age. ",
        "Round 3 - Accuses":"Clef",
        "Round 3 - Accusation":"I know what it is to be a young and impressionable ingenue. Young lady, if you'll accept some very wise 'big sisterly' advice, find a man outside of the business. Sure my Ducky is a bit older and his prostate makes him use the washroom every ten minutes... but he's stable. I warn you that in my experience, \"show-mances\" never work out. I see the way that young man, Clef, looks at you and it's dangerous to mix business and pleasure.",
        "Round 3 - Accused of":"scheming to replace Ivana.",
        "Round 3 - Rebuttal":"First of all, I am 42, thank you. Quite young and attractive enough to play any role I like. But, I didn't want the role. I gave it all up 18 years ago for something... someone... more important. Ducky was just being romantic and I told him not to make such a fuss.",
        "Round 4 - Accuses":"Clef",
        "Round 4 - Accusation":"Everyone's attention, please! There are exactly 23 steps on the grand staircase and that... is a prime number! What? Does no one else think that is important?",
        "Round 4 - Accused of":"being the source of perfume that lingers on the body. ",
        "Round 4 - Rebuttal":"There is no crime in having a signature scent. Speaking of scents, I too have a well-trained nose and I notice that Clef smelled of smoke... I assumed he was smoking due to stress, but after the fire alarm, I wonder... could he have started the first that almost killed us all?",
        "Round 5 - Accuses":"Seymour",
        "Round 5 - Accusation":"First as an artist, and now as a stateswoman, it has always been my job to be a student of human nature. We know that murders are most often motivated by jealousy, vengeance, or money. Mr. Seats... or should I say, Mr. Pavarotti?... Could it be that Morty, with his relentless scrutiny of the opera's books, was on the verge of uncovering a significant, perhaps even family-scale embezzlement operation? And that, Mr. Pavarotti, left you with no choice but to brutally judo-throw him down the stairs?",
        "Round 5 - Accused of":"you being seen alone with Mortimer in very close, hushed conversation.",
        "Round 5 - Rebuttal":"He... um... showed me a paper... Some evidence that Seymour was skimming money from the budget and he was concerned that as the producer, my husband would hold him accountable. I know that Mortimer would never do anything to hurt me and trusted him completely. If he gave his word, and that was good enough for me.",
        "Round 6 - Final statement":"Morty and I go way back. He was a director then and cast me in my first major role, Three Penny Opera. He loved me so completely, he even paid dearly to help me cover up for a terrible mistake that would have derailed my engagement to the Duke. \n\nHe was always protecting me, even taking the blame for the stage accident that disfigured Ego so long ago. That was me, Ego. Sorry. \n\nMorty told me that I had been found out, but that he would deal with it somehow.\n\nWhy would I eliminate the one man who continually kept my most scandalous secret under wraps? His death only puts me in a far more precarious position, leaving my past exposed. No, I assure you, I am innocent.",
        "Order of Final Statement":7,
        "Why it isn't them":"Was in her box"
    },
    {
        "characterId": "character-6",
        "Character":"Clef Hangar",
        "Short Description":"Conductor",
        "Sex":"M",
        "isMurderer": false,
        "suggestedAge": "Any",
        "costumeNotes": "none",
        "accent": "none",
        "suggestedCostume": "none",
        "suggestedProps": "conductor's baton",
        "Invite Description":null,
        "Character Details":"Maestro! You are the musical heart of 'La Mysteriosa', and your passion for the art is matched only by your… personal attachments within the company. Mortimer Curtainfall's meddling with your tempos and now the threat to your star soprano have ignited your temper. You will not stand idly by while your artistic vision, or your affections, are jeopardized.",
        "Motive":"Would do anything for the enchanting Vanna",
        "Means":"Could have pushed Mort",
        "Opportunity":"Stormed out during intermission, not seen after.",
        "Red Herrings":"- Seen pacing and smoking backstage, muttering about \"incompetent producers\" right before intermission\n- Angry threatening note in Mort's pocket \"You won't get away with this. I'll burn us all.\"\n- Singed letter? Something to do with fire\/smoking\n- Having an affair with Vanna\n",
        "Round 1 - Introduction Script":"Good Lord, the sheer cacophony of you all! Mortimer Curtainfall, silenced? What an utterly amateurish execution! I am Clef Hanger, the Conductor, and I assure you, this chaotic spectacle was not orchestrated by me. The opera is about harmony. It is about beauty. This... dissonance is most unpleasant. I was in my office, polishing my baton, and mentally rehearsing for Act Two, and now I am frustrated. I am stuck on \"so\" as it were. We did not reach the climax and resolve to the \"do\".",
        "Secret information":"Your passion for the opera extends beyond the orchestra pit. You are secretly having an affair with Prima Donna Ivana Killioux. You are a hothead and a notorious lothario. You have conquered many a diva, but Ivana has conquered you. Despite some misgivings from Curtainfall, you insisted upon her casting in 'La Mysteriosa.' Mortimer's threat to replace her filled you with a protective, furious rage.",
        "Round 2 - Story":"My orchestra members are union, you know, and they are threatening to strike if they don't get paid. Meanwhile, Mort is going on about ideas for new lighting and carpet. I pulled more aside a few days ago to tell him he needed to focus on his artists, and he snapped at me and said not to worry, that he \"Had a plan for milking a whale\" which, now that I think about it, can't be right...?",
        "Round 3 - Accuses":"Lady Beatrice",
        "Round 3 - Accusation":"Everyone knows who did it. Why are we even wasting our time. It was Lady Beatrice! That old dinosaur was pushing her blood-money husband to push out Ivana so that SHE could have her 'triumphant return to the stage'. Ivana, as we all know, got the job by being the best singer in the world, and NO OTHER REASON. ",
        "Round 3 - Accused of":"you kissing Ivana in the Green Room.",
        "Round 3 - Rebuttal":"What can I say? I love Vanna. I'd do anything for her. She sings like an angel, and is a devil in the... I mean, on the stage.",
        "Round 4 - Accuses":"Deirdre",
        "Round 4 - Accusation":"Director DeScript, your dedication to your 'art' is certainly... intense. But I wonder what Mort's office has to do with staging 'La Mysteriosa'? I saw you slipping into Mort's private office just before the first act, and then again, before intermission. The door seemed to offer no resistance. Were you 'practicing a solo'? ",
        "Round 4 - Accused of":"setting off the fire alarm.",
        "Round 4 - Rebuttal":"Fine, okay. I'm in anger management. My therapist says when I feel big feelings, I should write them down. I wrote a letter to Mort about how I... felt... about him even considering Lady B. 'old-and-over-the-hill' as a replacement for Ivana. Instead of acting on those feelings, I burned them in a metal trash can, no big danger there. I didn't think it would bring down the fire department.",
        "Round 5 - Accuses":"Duke",
        "Round 5 - Accusation":"After the first act break, I saw Mort enter the Duke's box when the Duke was away and he started talking to Lady Beatrice, very intimately. He handed her something. When she saw it, she started crying and Mort appeared to be hugging her. That's when the Duke walked in and he looked really jealous. Were you jealous enough to kill, Duke? I would be if I were you.",
        "Round 5 - Accused of":"you arguing with Mortimer about Ivana's replacement.",
        "Round 5 - Rebuttal":"I said I was sorry about the fire, okay! Even after I practiced what I was going to say by writing it down, I was a little... heated when I confronted Mort about him replacing the lovely, talented, limber, and... aggressive yet satisfying Ivana... and he agreed! He said he'd tell her right away. In fact, I was worried he'd chicken out so I watched him from the opposite boxes.",
        "Round 6 - Final statement":"Despite my anger issues, I'm a lover, not a fighter. My divine diva commanded me to deal with Mort, and I did! He agreed that she should remain the lead. It looked like he broke it to the ancient dusty Duchess soon after. I was looking forward to a \"prelude to amore\", not violence. I am innocent.",
        "Order of Final Statement":1,
        "Why it isn't them":"Was watching from another box"
    },
    {
        "characterId": "character-7",
        "Character":"Seymour Seats",
        "Short Description":"Head Usher",
        "Sex":"M",
        "isMurderer": false,
        "suggestedAge": "Any",
        "costumeNotes": "none",
        "accent": "none",
        "suggestedCostume": "none",
        "suggestedProps": "usher's flashlight",
        "Invite Description":"You have a chip on your shoulder and a thick New York accent.  Wears a suit or a tuxedo.",
        "Character Details":"You are the eyes and ears of the front of house, ensuring the smooth flow of patrons and the proper handling of… well, everything. Your loyalty to the opera house is strong, but perhaps your loyalty to certain individuals is even stronger. Recent whispers of scrutiny regarding the box office have made you uneasy.",
        "Motive":"Threatening to be cut out of the deal and blamed for everything",
        "Means":"Knows the ins and outs of the theater like the back of his hand, including the secret passages.",
        "Opportunity":"Knows the ins and outs of the theater like the back of his hand, including the secret passages.",
        "Red Herrings":"- Suspected in an insurance scheme to burn down the opera house?\n- Was skimming from the Duke with Mort",
        "Round 1 - Introduction Script":"The name's Seats, Seymour Seats. Every since I was a kid I loved the ushering business. I knew I had what it took to be one of the greats. I didn't want to follow in the family business, so I ran away. I slept in the washroom of the opera house and rose through the ranks. I started as a volunteer usher, then apprentice usher, then junior usher, then deputy undersecretary to the head usher, and, after 37 seven years, head usher. I wear a [suit or tuxedo] just like the 'Richie Riches' that come here for a fancy date. Instead, I'm here for every performance. I got more culture in my left n...ostril than they got in their Gucci purses.",
        "Secret information":"While you present as a diligent head usher, your real family name, though estranged, is infamous. You are, in fact, a member of the notorious Pavarotti Crime Family. You learned the family's criminal recipes at an early age, though you chose a different path. However, old habits, and old connections, sometimes resurface when under pressure. Curtainfall was pushing you hard regarding the Duke's funds, and your family's history suggested how certain problems might be handled.",
        "Round 2 - Story":"Sure, sales are down. Opera isn't the hot ticket that it once was, it's hard to compete with \"Fast and the Furious 27 - Just a little bit faster and furiouser,\" but this production was going to change all that. It was going to get the people talking. Deirdre is... very demanding and passionate about her productions and it was working. The show was shaping up to be a smash hit.",
        "Round 3 - Accuses":"Duke",
        "Round 3 - Accusation":"While investigating smoke alarm, I saw the Duke cleaning something from his gloves. Soot? Poison? I had to grab the fire extinguisher so I didn't get a chance to look closely. By the time I had dealt with things, he was gone. What were you doing backstage anyhow?",
        "Round 3 - Accused of":"you sneaking a paper to Mortimer.",
        "Round 3 - Rebuttal":"I was giving Mort the evidence of the arson that set off the fire alarm. It was a piece of burned paper that was hard to read. It said something like \"My heavenly siren\"... some charred bits, and then \"throw you from the...\" something.",
        "Round 4 - Accuses":"Ego Cadenza, Understudy Tenor",
        "Round 4 - Accusation":"Let's talk about the real ghost haunting this opera house: Ego's past! 18 years ago, a terrible stage accident left you disfigured, forcing you into hiding. And who was the director of that very production? None other than Mortimer Curtainfall! You've been living in these walls, literally, nursing your creepy, spooky rage, blaming him for ending your career and ruining your life, haven't you?",
        "Round 4 - Accused of":"having a shady family background.",
        "Round 4 - Rebuttal":"I should've known this was coming. A private investigator, eh? The truth, much like a badly behaved patron, always finds its way to the front row. I was, I am, a Pavarotti...\n\nMy great-aunt Elena 'Enforcer' Pavarotti used to bake me cannoli filled with handwritten notes about 'joining the team.' My cousin, Luigi 'Leg-Breaker' Pavarotti, used me to practice his finer points of 'negotiation.' And my uncle, Bobbi 'Bubbles' Pavarotti, constantly reminded me that the 'family' could always use a good 'laundromat.' I tried, Your Grace, I truly did, to simply usher, to guide patrons to their rightful places. But it seems... every time I thought I was out, they pulled me back in!",
        "Round 5 - Accuses":"Clef",
        "Round 5 - Accusation":"Whoever did Mort would have to get behind mister baton over here. During the intermission, I overheard him arguing with Mort, saying he'd 'burn the place to the ground'. Was the fire going to be an insurance scam or murder by fire?",
        "Round 5 - Accused of":"financial irregularities.",
        "Round 5 - Rebuttal":"If there were any discrepancies in the books, that sounds like something the producer would be responsible for and you'd have to take that up with Mort. Or maybe you did?! Maybe you and your husband saw that ledger page and did him together?",
        "Round 6 - Final statement":"The creative accounting I helped carry out with Mort, while perhaps not strictly legal, was fuel for saving the opera itself... and my own lavish ushering lifestyle. I've tried to fight against my Pavarotti blood, and for a long while I succeeded. Until I didn't. Still, I'm a good usher, and a great embezzler. I would not have jeopardized our entire operation, and this great institution, by resorting to murder. I didn't do it, ya mooks.",
        "Order of Final Statement":6,
        "Why it isn't them":"Why turn on his partner? They were still conspiring together that morning."
    },
    {
        "characterId": "character-8",
        "Character":"Penny Prattle",
        "Short Description":"Opera Influencer",
        "Sex":"F",
        "isMurderer": true,
        "suggestedAge": "Any",
        "costumeNotes": "none",
        "accent": "none",
        "suggestedCostume": "none",
        "suggestedProps": "smartphone",
        "Invite Description":null,
        "Character Details":"You are the sharp-witted influencer with the famous \"Three Penny Opera\" TikTok channel , always on the lookout for the next scoop. This production was ripe with potential stories, but little did you know you would become part of the biggest headline of all. Your relentless pursuit of the truth often leads you down unexpected paths.",
        "Motive":"Wanted recognition from her Father",
        "Means":"Could pose as interviewer and surprise Mort",
        "Opportunity":"Admits to being in box next to the Duke's right around the time of the murder.",
        "Red Herrings":"- Was losing access to the Opera House and thus her livelihood\n- Stole the Threepenny Opera playbill from his office and underlined wrote on it\n- Phone is missing?",
        "Round 1 - Introduction Script":"Hey fam. I'm Penny Prattle, and I'm hanging out with the who's who of the opera world because, get this: there's been a murder and we're all sus A.F.! How wild is that?! It could be anybody, and I'm like low-key scared for my life right now. If you want to make sure that I'm not brutally murdered, you simply HAVE TO like and subscribe and you'll get all my updates as I stream live from the crime scene! I'll be sure to get to the bottom of the story, like I always do.",
        "Secret information":"I just turned 18 and got the paperwork from the orphanage where I grew up. Mortimer was the one who signed me over, but my mom wasn't listed. I wanted to get to the bottom of this mystery by first getting close to Mortimer. When I confronted him, he blew me off and told me he'd carry that secret to the grave. \n\nI AM THE MURDERER.  I kind of lost it and hit him over the head with a champagne bottle, then tossed the evidence. Do not confess to this, or reveal any details of the act itself, until you are explicitly instructed to do so. Your identity as the killer is your deepest secret.",
        "Round 2 - Story":"Okay, so like, I was up in the catwalks, getting some serious B-roll for some spicy voice overs later, right? And I kept hearing this, like, horrible moaning sound [mimic operatic singing]. I think this place might be for-real haunted and, like, maybe a ghost did it. How epic would that be?!",
        "Round 3 - Accuses":"Ego",
        "Round 3 - Accusation":"I was given access to pretty much everywhere in the operahouse and one thing that's been giving me major icks is Ego... He's always popping up out of nowhere and disappearing without a trace. He's always sneaking around. He's, like, stalking me or something.",
        "Round 3 - Accused of":"you sneaking into Mr. Curtainfall's office.",
        "Round 3 - Rebuttal":"Sure, I'm nosy. My whole vibe is giving my followers that exclusive, behind-the-scenes tea on how operas get made. That's why Mr. Curtainfell hired me. It was mutually beneficial content creation, you know?.",
        "Round 4 - Accuses":"Ivana Killioux, Prima Donna",
        "Round 4 - Accusation":"Oh, Ivana, don't pretend you're all soft girl aesthetic! We all know the drama doesn't just, like, poof! when you leave the stage. One of my sources — and they're spilling the tea hard — told me that Mr. Curtainfall was going to replace you with Lady B. and that you were big mad about it. My source says you shouted about him 'ruining your life' and threatening to 'ruin his'!",
        "Round 4 - Accused of":"crying in the bathroom.",
        "Round 4 - Rebuttal":"OMG, you literally know how to make it a moment with that observation! I was getting some super intense tea on a new story, and it hit me kinda hard. It's called being emotionally invested in my content, okay?!",
        "Round 5 - Accuses":"Lady B",
        "Round 5 - Accusation":"Okay, so like, after Mr. Curtainfall was being all 'period,' telling me to pack up my things, I went to go grab my stuff, no cap. My stuff was in the box literally right next to where the Duke and Duchess usually chill. And that's when I overheard Morty—yeah, that's what this queen calls Mr. Curtainfall—telling Lady B. that he had something super important to tell, and he didn't think she was going to like it... I didn't hear what he said after that, she just started full-on waterworks.",
        "Round 5 - Accused of":"Sure, I'm nosy. My whole vibe is giving my followers that exclusive, behind-the-scenes tea on how operas get made. That's why Mr. Curtainfall hired me. It was mutually beneficial content creation, you know?.",
        "Round 5 - Rebuttal":"The paper... was my contract. He said I shouldn't have been all up in his office and I was banned from the operahouse and I couldn't film my 'Top Tiks'. Yeah, that's what he thought it was called. Well, it's his loss, or it would be if he weren't unalive.",
        "Round 6 - Final statement":"I have always been driven by a TikTok influencer's pursuit of truth, and the truth was that Mortimer Curtainfall was my bio-dad. Plot twist, right?! I just turned 18 and got the unsealed adoption papers which only had one name, his. I ransacked his office and found his letters to Beatrice Sharp and I knew immediately, she was my bio-mom! I showed it to him and he swiped it out of my hands and ordered me to leave!\n\nHe abandoned me, pretended I didn't exist for 18 whole years, just… crickets, and now he was basically telling me I'm not even worth a single like. \n\nSo, yeah, when I was leaving after he fired me and he turned his back on me at the top of those stairs and the Duke's champagne was just chillin' there, it was like the universe was telling me: 'Girl, this is your main character moment.' He wanted to act like I was invisible? Fine. But he won't be ignoring me from the grave. He got what he deserved. And honestly, it was pretty iconic. Next segment: how to get away with murder, featuring your girl, Penny Prattle. Just kidding! Or am I? Stay tuned, fam.",
        "Order of Final Statement":8,
        "Why it isn't them":null
    }
  ]
}